{"chunks":["Reigen's log:\n\nI was called in to exorcize a spirit from Frank's wife again! Rich people are so eccentric!\n\nAs always she was fine, just sick of Frank's shit.\n\nBut now I have a full paid vacation in this transport ship that I would never be able to afford on my own! It belongs to the Oddjobers if I'm not mistaken.\n\nWe were invited to listen to something called the hum, which is an auditory phenomenon that can be heard from on the deck of the ship.\n\nIt was beautiful..\n\nI met Johnny Mythrilhand. Typical superstar. He was a bit of a jerk. \n\nSasafrazz killed both the captain and airplane Dave.\n\n\n\nThe ship was still stuck on something and a clocking device went down showing a huge egg shaped station Floating there. A piece of the station dispatches and heads in our direction. \n\nThe droid tried to take Sassafraz but we stopped it. Johnny mumbled something about being targeted. I don't know, I think he needs to drink less. \n\nThere was another person there named Chimer that seemed to get through to the robot. Johnny asked why we should go with it and it pulled out a gun in response!! Is everyone crazy?! I have to get out of here..\n\nA big booming voice came on and invited us on to the egg looking ship telling us that it was the odd jobbers that were in charge. \n\nWe get escorted by the little droid through a sterile space that holds different creatures And scientists. \n\nOne of the scientists tells us that The egg is a bioresearch lab where they make extinct animals. He took our food or","tle droid through a sterile space that holds different creatures And scientists. \n\nOne of the scientists tells us that The egg is a bioresearch lab where they make extinct animals. He took our food order for some reason while waiting to see someone named the “host”.\n\nHe took the robot man named Hui and the other robots to go charge them. He also took Johnny's autograph. He took Hui the droid and Sasafrazz to the charging room and left them without saying a word, not realizing that Hui was a person. From Sassafras’ destroyed body an ooze slithered out of the robot. Hui recognizes it as a plasmoid. It said its name was Bob. They became quick friends, the plasmoid even cleaned up the rust off of Dog. He told Hui that he was a part of a different Slime but fell off and became its own thing.\n\nWe met the host. He was a cyborg that mistook our Group for the actual odd jobbers and requested a job off the books. Ultimum ink took down the Revis company but they were exposed as bad guys. \n\nHe pulls out schematics Revis wasn’t just the name of their company it's the name of a machine they were attempting to make that sits unfinished missing 4 parts. This machine could “save” the world. \n\nAlberto a locator this locator has the ability to find anything anyone and anywhere through plains space or whatever- currently located On rodina \n\nNegrado a transmuter that can transform any one thing onto another- on the march ( it's the purge 24/7 there. There are cities where it's a safe zone for the","or whatever- currently located On rodina \n\nNegrado a transmuter that can transform any one thing onto another- on the march ( it's the purge 24/7 there. There are cities where it's a safe zone for the higher ups of society)\n\nRubedo fabricator can make - locator Sulfur\n\nCitriditus an analyzer that can generate any kind of information ever needed it is ultra mega super chatgpt was on phantoma (the ghost planet that is no longer there)\n\nWe got all that in writing and took a ship.\n\nOn the way we get intercepted by the lemon knights. \n\n\n\nLincoln Station\n\nFlip a coin named the lucky Lincoln \n\nJohnny worked security\n\nPatrick worked the lost and found \n\nJimmy worked in Sanitation \n\nHui worked security\n\nReigen worked the gamblers\n\n\n\nHui working repairs was Talking to Mavis Cooper, she was a middle aged woman working as the head of the security Area and just like Hui she was in extreme depth and was stuck In her situation. \n\nShe was hurrying him to finish the repairs before the coin tossing Ceremony that will happen in 2 days \n\nHui while working fixed the cameras and noticed the existence of a fighting pit! He asked Mavis, she told him That Cornelius was a big gambler and liked to bet on peoples lives not just card games\n\n\n\nJohnny working stands as a poor quality shipment arrives. A man in Chef's clothes comes out and starts yelling at the delivery man . The chef is called Elias Cooper. He was married to Mavis. Elias looked exhausted and overworked while arguing with the delivery man w"," Chef's clothes comes out and starts yelling at the delivery man . The chef is called Elias Cooper. He was married to Mavis. Elias looked exhausted and overworked while arguing with the delivery man who seemed to be dishonest. Johnny stepped in and spoke up for Elias. Elias went into the truck and helped himself to the better produce that the driver was hiding under Johnny's protection who thanked him.\n\n\n\nBob was cleaning the toilets with the help of another employee, a lady. She stepped outside to take a quick break from the smell. Bob used the vents to Move around and now understood the layout. The Vents that went over the gambling areas had electric currents going through them to deter cheaters. A well dressed man entered the bathroom looking disgusted. He asked Bob, who was wearing a disguise To follow him. He leads him towards a hotel room and It’s a mess. It was the presidential sweet. He looked inebriated and he looked to have Been living there. One sweet was above this one monk melon one of the co owners lived there. On the table a pamphlet spoke of the masquerade ball for the coin toss. People from all over the solar system are coming for this thing. \n\n\n\nChimer when they walked past him he interacted with Bob. He finds 2 things in his pocket: an Access key that grants him access to most of the hotel, and a small vial of a potent poison. He emptied Out an inkwell and used it to store the poison and replaced it with \n\nHe snatched the jacket From Patrick's hands and che","m access to most of the hotel, and a small vial of a potent poison. He emptied Out an inkwell and used it to store the poison and replaced it with \n\nHe snatched the jacket From Patrick's hands and checked to make sure that nothing was missing. He found the passkeys missing\n\n\n\nReigen's In the gambling hall doing his usual shpiel . I spotted someone I knew.  It was Frank!  \n\nThe security guard smiles at me and moves me aside to let through an incredibly wrinkly old woman that looked like she smoked since birth. Another younger black skinned woman who had a military air to her walked with her like a bodyguard. The old lady was wearing a dirty overall over an extremely nice clean outfit. He explained to me that this was Gloria Slugbottom. The head mechanic on the godot system, she liked to gamble. But spent most her days on Rhodina working, the younger lady only known as Edith who was her personal security. Reigen tips the security Guard who seemed to appreciate it and takes Frank to his room. \n\nIn the seathy underground part of the place where slop or as they call it lunch was served. We were discussing what we found out and I mentioned Gloria and Hui perks up surprised. He rushes off trying to talk to her. He told us that he had a meeting with her in a couple of days but wouldn't tell us why. \n\n\n\nSecurity guards start to walk through the room. A circle of refugees stand in a circle back to back hiding something behind them and an individual tries to sneak up on the guards to at","ell us why. \n\n\n\nSecurity guards start to walk through the room. A circle of refugees stand in a circle back to back hiding something behind them and an individual tries to sneak up on the guards to attack them with his food tray. He smacked the guard, dropping his helmet Revealing that he was a robot like Mr sassafraz.  He turned around lifting his left arm which was a giant blaster putting a hole in the attacker. A bright light was visible but it was silent so as not to disturb the guests . Johnny and Hui went towards the people that Were hiding something. They found a large bald hairy man. He asked them if they were chill. Turns out they were hiding a young boy who they had given the best parts of their meals.\n\nThey discussed escaping And they told Johnny that the best time to pull anything like that would be during the coin toss ceremony. \n\nChymer gave us the key card he had found.\n\nJohnny expressed his concern about using The card when it would have probably been reported missing. Hui copied the card, he made one for each of us and an extra one. Chymer requested a realistic replica of the lucky Lincoln from Hui. \n\n\n\nThey went to look at the coin to be able to replicate it correctly. People walking around in lavish outfits And masks. People coming in to the hotel and others rushing into the casino\n\n8 foot tall woman with big exaggerated muscles Looks human with a robot arm. But better quality cybernetics. She stood next to the pedestal that held the lucky Lincoln on displa","shing into the casino\n\n8 foot tall woman with big exaggerated muscles Looks human with a robot arm. But better quality cybernetics. She stood next to the pedestal that held the lucky Lincoln on display in a glass case. \n\nThey try to approach the display case but she tells them to leave. But Hui catches enough of a glimpse to be able to replicate it.\n\nA robot calls Johnny to the fighting pits because security is needed. He drags him there in a hurry and pulls him into a corner of the gladiator area where the last security guards body was still lying there seemingly accidentally shot to death. The enforcer robot places Jhonny there and drags the other body away \n\nIn a glass vip box a green suited man with a thin goatee and many women surrounding him was Cornelius figg one of the owners of the space station. Bets were placed. people cheered as others fought to death. \n\nA child holding an electric guitar stepped out into the arena. The crowd made a huge fuss but they weren’t booing or cheering, just rowdy. He had to be pushed to snap out of his shyness and started singing. Beck Cooper the working son, the entertainer. He sounded tired but competent Johnny saw potential.\n\n \n\nI wasn't there but apparently Tabaga and Johnny are fighting in the pits \n\nChimer diluted the poison just enough not to kill you and is planning on serving it during the coin flip ceremony. \n\nIn the fighting pit Cornelius Figg told Johnny to rig the fight so that CJ could lose. He buys a piece of equipment fro","h not to kill you and is planning on serving it during the coin flip ceremony. \n\nIn the fighting pit Cornelius Figg told Johnny to rig the fight so that CJ could lose. He buys a piece of equipment from the store of the fighting pit. Johnny suggested that he pretends to knock CJ out and arrange an escape for him \n\nReigen headed to the hotel to return \n\nHui gets called into the security room to fix a malfunction. When there they told him that someone was cheating and they wanted the surveillance footage but it was fucked with. Mavis Cooper gived Hui a knowing wink and left him in charge of the surveillance room he noticed that in the hotel Thelian Rimane the one who shot mr sasafrazz was hiding out in the hotel. He was able to broadcast the video of him murdering sasafrazz into his bedroom and proceeds to blackmail him. Thelian runs out of his hotel room and books it. Hui also finds out that Frank was the source of the issue. \n\nChimer and Jimmy get taken to the kitchen to help out. Jimmy convinces Elias Cooper that the dishwasher is god and send him on a mission to transport Tabaga's unconscious body out of the fighting pit. \n\nJohnny and Tabaga fight, Tabaga actually fights hard. Hui through reflections could see what was happening, he hacks into the smoke systems but the machines explode damaging the fighting pit hurting Johnny and Tabaga. In the chaos they evacuate Cornelius figg from the fighting pit as Johnny knocks Tabaga out as a kitchen employee dressed as a medic and ca","explode damaging the fighting pit hurting Johnny and Tabaga. In the chaos they evacuate Cornelius figg from the fighting pit as Johnny knocks Tabaga out as a kitchen employee dressed as a medic and carries his body out of the room. Once there was the malfunction in the fighting pit employees rushed there pushing Hui off the panels \n\nJohnny standing in the middle of the fighting pit as black clouds of smoke bellow. He wiped his brow watching vents open up to clear the air. Cornelius Figg looked back at Johnny shocked as Johnny screamed at him asking if he had caused this explosion to help beat Tabaga. Cornelius nodded his head and gestured to him that they would talk later. Johnny pretends to limp away as he gets escorted inside. The young Ben Cooper looked at Johnny with big eyes asking “did you do this for him?” Johnny gives him a wink and the kid looks at the fake medics recognising the kitchen staff. He flashed Johnny a big smile. Johnny reminds the kid to keep his identity a secret. \n\nThe manager Geeves was standing at the front desk as two guests yelled at him. He helps them I talk him into \n\nI turn into Geeves and walk up to the VIP section as Cornelius Figg \n\nMump Mellon, a large set man with a little moustache and a bowler hat sitting on a floating chair doing calculations or something. Figg walked in talking about Mump's machines exploding \n\nMellon thanked Geeves for coming and thanked him for his efforts in managing the refugees. Cornelius asked Mellon what his plan","s or something. Figg walked in talking about Mump's machines exploding \n\nMellon thanked Geeves for coming and thanked him for his efforts in managing the refugees. Cornelius asked Mellon what his plan was. He pulls up a floating screen with a giant moon like structure with a giant cash sign claiming that they would use the workers to build it as they chuckled maniacally. This thing seems to be a year away from being created they called it the dept star. It has the ability to collapse an economy in one blast.\n\nCornelius brought up Tabaga talking about the fight with Johnny. Johnny had been made. They had a chart with all of Johnny's information on it. It seems like he had gone under many aliases and one file was named the incident. Eve Stabber was hired to protect the Lucky Lincoln. Cornelius thinks Johnny is here to kill her so he suggested adding him to the kill list. I pretended to take note of his order. He shows the schematics of a new barrier that he has erected that stops you entering if you have any weapons on you guns knives swords. \n\nThillian Romain \n\nIn the kitchen a man wearing an unconvincing medic costume dragged in an unconscious Tabaga. Elias falls to his feet in front of the washing machine asking for orders. Bob asks Johnny what to do with Tabaga. He said to store him somewhere.  Chimer cast cure wounds on Tabaga and told them that the great dishwasher god cured him. Then he instructed the chefs to fall to their knees and worship the dishwasher god. So they d","e him somewhere.  Chimer cast cure wounds on Tabaga and told them that the great dishwasher god cured him. Then he instructed the chefs to fall to their knees and worship the dishwasher god. So they did. Bob and Chimer disguised Tabaga and changed their clothes and left her as a fake employee in the kitchen. Chimer gave Tabaga his familiar Yippee. \n\nChimer went to check out the Lucky Lincoln seeing a giant muscular woman standing there. He bought a bunch of masquerade masks for everyone and went to the lost and found and took a suit with a ketchup stain on it. He disguised himself with it and one of the masks. He checked out the barrier finding out it worked as glass and was told to step off by the giant woman. We all met in the kitchen and told them everything I found out. Chimer asked him what he thought about him. He promptly told him that he didn't think of him. So Chimer offered him a sandwich. Johnny didn't take it sniffing it. We talked about the information we gathered and Chimer distributed the masks and showed us the replicas of the Lincoln coin telling us that he planned to slip them into pockets of guests and the lost and found and other random places. \n\nI took Johnny aside and told him that like him and Stabber I too used to work for Fathom Ink and that I was here to help him with the revolution. He was very happy to hear that and asked to be given the opportunity to fight Stabber. I accepted having never planned to fight. \n\nJohnny asked if Hui could hack the rob"," help him with the revolution. He was very happy to hear that and asked to be given the opportunity to fight Stabber. I accepted having never planned to fight. \n\nJohnny asked if Hui could hack the robots to rig them to blow up. He told us that he could do it from the control room. We also discuss the barrier. It is controlled from the generator room. We discussed the mechanics of the barrier and carrying weapons. We decided that I will pretend to be the manager named Geeves and that I still had the ID card for and give Eve Stabber some tainted food.  Bob could slip the coins into guest pockets then join Chimer and Johnny to enter the ceremony in disguise, donning the masks that Chimer had purchased. \n\nHui tried to buy us more hours by telling the people in charge that there is a fault in the system but they refused to make an exception. So Hui told them that he needed to reboot the system from the generator room. They told him to do whatever the fuck he wanted. He sabotaged the barrier and the communication terminal, they stood waiting to crash when he wished for it. I took a mask and a coin and went looking for a suit. Johnny instructed some of the refugees to cause little comotions around the ship \n\nHeist Day\n\nI disguise myself as Geeves and sneak Bob into the vents. He slipped around expertly slipping the coins into the guest pockets \n\nHui came and took his position in the control room as the past shifter left.\n\nChimer and Johnny in disguise blending in with the guests. \n\n"," around expertly slipping the coins into the guest pockets \n\nHui came and took his position in the control room as the past shifter left.\n\nChimer and Johnny in disguise blending in with the guests. \n\nI took two sandwiches to Eve Stabber who ate them both impressively fast.\n\nMelon and Fig enter and pretend to be mean mugging at each other as the crowd is divided cheering for either man. Cornelius suggests turning the station into a huge resort. Melon disapproved and asked for quality over quantity. They raised the glass from over the coin and lifted it up in unison. The weapon barrier was lifted letting people pass. Cornelius and Mump were mingling with the crowds. \n\nHui went to his meeting with Gloria Slugbottom. A young woman in stilettos and a military uniform stops him and asks him what he wanted. Hui wanted to discuss the work of his creator and what he could do to stop the apocalypse. As the bodyguard was about to tell him off, Gloria told her to let him through, never looking up from the gambling table that she was sitting at. Hui joined her only to see that they were betting on hamster races. He fabricated a hamster as Gloria sucked on her cigarette. She eyed his hamster as she pulled out a hamster also smoking a cigarette and put him down. They exchanged pleasantries and she told him about his creator and his beloved barrier. She tells him that the world is moving on just fine without his creator. Hui told her that it wasn't true and that was why he was here, that's w","she told him about his creator and his beloved barrier. She tells him that the world is moving on just fine without his creator. Hui told her that it wasn't true and that was why he was here, that's why his creator made him. A man named Henry added a steroid hamster to the race asking them with concern if they are talking about anything that he should be worried about. Gloria ashed her cigarette on his shoulder told him to mind his own business and called him a cuck because his wife was sleeping with another man. Hui asked Gloria to help him. She told him if he could make his way to Rhodina she would help him. But she told him to make his own way. He bet her that if his hamster wins she would leave word to let him into the planet. Being a betting woman she took his bet. The steroid Hamster takes off and Gloria's Hamster put it's cigarette in Hui's Hamster's gears. The cigarette hamster takes off with impressive speed passing the steroids hamster Hui's hamster neck in neck with the cigarette Hamster taking the lead at the final stretch. Gloria gave him an invitation to Rhodina. She told him that she had something to tell him. She spoke of Hui's creator and told him that he worked with a company named Rebis. Newton and them teamed up for a while. They eventually came to a disagreement then left them. They were defuncked by ltimum ink. Which means they had abandoned HQ one underwater on Apatia the worker planet. She tells him to protect his face because he looked like Newton who","ent then left them. They were defuncked by ltimum ink. Which means they had abandoned HQ one underwater on Apatia the worker planet. She tells him to protect his face because he looked like Newton who she thought to be handsome. They said their farewells and Hui left to go take his position for the heist. \n\nMelon and Fig go tell the people to gather for the coin toss. Everyone huddles together. Johnny kept a close eye on Eve, she noticed him and walked up to him, he flirted with her out right. She blushed and apologized for sounding flirtatious. He insisted that he liked big women, then turned to order a drink and ordered the johnny Mythrilhand special. She giggled and told him that she knew Johnny and that he was a piece of shit that got his girlfriend killed. Johnny almost gave himself away but kept his composure. She flexed and told him that she was hired as extra muscles, trying to impress him. Johnny played along.\n\nThe coin toss ceremony began. An announcer set the stage as the crowd cheered then suddenly they stopped cheering and started running away. Eve grabbed her stomach but held herself together. She looks down at Johnny and grabbed his mythril hand and slapped away his mask and told him “I've been looking for you” Johnny had cast hex on her when she first walked up to him. Grabbed her back put his gun in her gut and fired.\n\nFight for the Lucky Lincoln \n\n\n\nBob was in stealth \n\nCornelius and Mump decide to start the countdown in the comotion. A minute starts countin"," him. Grabbed her back put his gun in her gut and fired.\n\nFight for the Lucky Lincoln \n\n\n\nBob was in stealth \n\nCornelius and Mump decide to start the countdown in the comotion. A minute starts counting down on a big screen, that they will flip the coin at the end of. \n\nCornelius pulled out his gun and tried to fire twice at Chimer, but he missed. Chimer attacked the robotic guards\n\nJohnny moved away from Eve and shot at her again startling her pushing her backwards she got very angry about it. \n\nHui in the control room sabotaged one of the robots while mewtwo fought off some more coming to intercept them. The guard that Chimer attacked swung back at him but failed miserably! I sent a string of insults at Mump who tried to fire back at us but we expertly sidestepped his beam.\n\nEve's arms split in half and picked up more guns she was now carrying four guns! She fired, singing everything in her path. Cornelius and Melon started fiddling with their watches calling in more reinforcement. Hui tried to intercept the command but failed. Chimer attacked the guard in front of him, while the one in front of me swung over my head as I sneezed. Bob was doing something to Mump but I couldn't see what he did. Cornelius shoots at Johnny, missing him. Johnny turns his intimidation towards Melon who freaks out in response. Hui detonates one of the armors damaging Mump and another robot as Mewtwo fights off the ones trying to stop Hui in the control center. The guard in front Chimer attacked bu","ho freaks out in response. Hui detonates one of the armors damaging Mump and another robot as Mewtwo fights off the ones trying to stop Hui in the control center. The guard in front Chimer attacked but missed. I slipped the fake licky Lincoln into Mump's pocket realizing that Bob seemed to have removed the real one. Cornelius and Mump try to have the lights go off but Hui intercepts the order and instead activates disco mode. Lights and colors and music fill the room. Chimer attacks the guard that has been focused on him, slicing him in half!.. with a stick!. Johnny and Cornelius shoot at each other Johnny skillfully gaining the upper hand. A robot slashes at Johnny but some robotic magic heals him almost instantly. He turns his attention back to Cornelius. I command Eve Stabber to steal the fake Lincoln from Melon, making a big scene of retrieving it and giving it to Chimer. Mump pulls out a gun and shoots Eve in the back of her head but the shot sizzles away when it hits her. What a beast. She turns all four of her guns at me and shoots. She misses most of them but hits me in the shoulder. I admit to deserving that!. Chimer attacks more of the guards. Bob attacks Eve Stabber leaving her looking really hurt. Johnny fires at her as well. Hui in the command room had the foresight of hiding emps in the hallway but they unfortunately backfired when he triggered them hitting him in the process!. I turn into Cornelius and we start dancing together. The guard swings but his blade b","of hiding emps in the hallway but they unfortunately backfired when he triggered them hitting him in the process!. I turn into Cornelius and we start dancing together. The guard swings but his blade bounces off of Chimer's scales. Mump pulls out components and cast fireball hitting Bob and johnny. Bob goes down the Real Lucky Lincoln clanging to the ground menacingly. Eve runs!. Cornelius stuck dancing with me Mump is the only one that calls a guard. Chimer exchanges the fake coin for the one that he had for the one that had just clamored to the ground. The guard swung at Cornelius mistaking him for me but he deflected it expertly still dancing! The fight went on. Johnny attacked the retreating Eve mercilessly. Damn they really hate each other. Pretending to be Cornelius I tell Eve that we should have hired Johnny Mythrilhand she looked so offended that I think it actually hurt her! I jump over and Heal Bob. Eve retreats. while Both Cornelius and Mump swear at her incompetence.  \n\nGuard walks in holding unconscious Hui hostage. A blade to his neck. He was too far for any of us to reach on time! We start to run.. Johnny maintaining intense eye contact told Chimer to toss the coin but before any of us can do anything the robot froze and dropped Hui. Behind him stood…\n\nFrank!! holding the little Device that he had been using to cheat at gambling. The guard turned furiously trying to swing at Frank but Johnny had reached in time and stopped the Robot saving Frank. \n\nHui thanked h","ng the little Device that he had been using to cheat at gambling. The guard turned furiously trying to swing at Frank but Johnny had reached in time and stopped the Robot saving Frank. \n\nHui thanked him politely then tried to communicate with Mewtwo but got no signal back. He throws a handful of coins into the fight and Mump's face drops. Chimer uses the diversion to attack Mump, hurting him badly. Chimer growls a command and Mump surrenders. I mimic him as Cornelius. Bob oozes himself off the ground and jumps straight back into attacking the guard in front of him. The workers who had jumped into the fight aided us by attacking some of the guards. Johnny takes the real coin from Chimer \n\nI pretend to surrender as Cornelius and all the robots power down thinking that both their masters \n\nJohnny flips the coin as the timer comes to an end. The guests returning from their bathrooms, johnny wishes for the station to become the property of the coopers as the workforce and the guests hold their breaths\n\nThe coin lands on head and the celebration start but everyone stood confused as confetti was dropped and the robots started serving drinks to the flabbergasted guests.\n\nAftermath\n\n\n\nRebis parts are:\n\n\n\nAlbedo is on rodina (locator)\n\nNegrado is on the march (transmuter)\n\nRubedo is on sulfur (fabricator)\n\nCitrinitas is on the phantoma. (analyser)\n\n\n\nThe guests start to panic\n\nAll the refugees rush the stage hoisting us and a few others as heroes over their heads.\n\nHui tried to contact","fur (fabricator)\n\nCitrinitas is on the phantoma. (analyser)\n\n\n\nThe guests start to panic\n\nAll the refugees rush the stage hoisting us and a few others as heroes over their heads.\n\nHui tried to contact Mewtwo again with no response. He jumped down and grabbed whatshisface and intimidated him trying to shake him down? People need to start cutting me into their rackets! He was from Apatia. He used to be a high ranking member of the niku social media website after he quit he vanished\n\nElias Cooper helps us relax they serve us drinks. I saw Hui slip away and go stand over his big destroyed friend I went over and help him Chimer helped in his own way. Hui's eyes flashed and he started working on a new thing, I stepped away to get drinks, the guests were scrambling to leave the refugees escorting them gruffly out of the hotel. I went upstairs and moved the party to Mump Mellon's room. I turn around to see Bob oversaturated with stolen jewelry, I gave him a drink and Hui searched him for some gems to use in his new construction.\n\nIn the back the animals were hungry \n\nChimer and Johnny tell them to feed them and release them back into the wild. \n\nJohnny goes to talk to Hui and has him pimp out the guitar who does it almost effortlessly. \n\nI step out on the stage and present him to the crowd. Johnny and Chimer encouraging him, he performs nervously and shaking but in its own way it was beautiful.. the sound of freedom. \n\nA week has passed, Hui completed fixing Mewtwo. Johnny went aroun","wd. Johnny and Chimer encouraging him, he performs nervously and shaking but in its own way it was beautiful.. the sound of freedom. \n\nA week has passed, Hui completed fixing Mewtwo. Johnny went around finding out information about the refugees they are from impoverished areas from Apatia and are debating whether or not to return or start a floating settlement. The corruption in Apatia wa flagrant. Bob noticed that there is a pattern where there are hits taken out on the CEOs of the companies but he couldn't \n\nChimer is chilling with the animals, they remained wary of him but no hostility. \n\nHe spun the Lucky Lincoln in his fingers. The more he stares at it the less it looks like heads and tail. It looked like the artifact that Johnny found. An artifact from the March. It was a piece of something bigger.\n\nDoing research on the Rebis foundation their public mission was to re-expand the universe. They were taken down by Ultimum ink who was trying to create a simulated life. During a very violent coup Ultimum ink sent soldiers to every Rebis location and wiped them out. Johnny Mythrilhand is the one that blew the whistle on them forcing them to become a criminal organization and putting him on the shit list. Bob spent the time making three extremely believable disguises. \n\nThe police came and arrested Mump and Figg and help us with transferring the ownership of the station. \n\nI found a list of Donors two of them much more than the rest they buy a ton of refugees/slaves. No names","e came and arrested Mump and Figg and help us with transferring the ownership of the station. \n\nI found a list of Donors two of them much more than the rest they buy a ton of refugees/slaves. No names but a contact for both of them. They have spent upwards of 20 million gold pieces each.\n\nA client only known as a first woman puts a hit on Johnny alive for 2000 gold pieces. \n\nWe sat around the VIP area previously Mump and Figg's quarters that we claimed for our own. Suddenly Johnny had a woman overimposed on his body warning us about the dangers of going into the deep web. She warns us and leaves.\n\nWe asked him wtf and he told us that he had died 100 years ago when Ultimum captured him. They kept his consciousness and one bad ending cyberpunk later he now roams again.\n\n \n\nWe get into the ship named the Marlin Manson even if the others insist that it's called the Blue Marlin\n\n\n\nTobago finally wakes up in a crate to the sound of voices talking in languages that she didn't understand. It sounded like a deal and then she felt the box that she was in moving and being loaded on a vehicule of sorts. After a while a crowbar ripped the box open and Tobago sat up finding herself in a Japanese bath house facing a man with a big back tattoo of a large dragon he had elven ears completely naked. He asked her to join him. She does as two servants take her clothes and spray her with nice smelling water and soap. Many servants in Kimonos served them drinks. Tobago asked for a fancy juice, rece",". He asked her to join him. She does as two servants take her clothes and spray her with nice smelling water and soap. Many servants in Kimonos served them drinks. Tobago asked for a fancy juice, receiving an alcoholic beverage. The naked man toasts Tobago introducing himself as Botan Shimana of the Shimana Clan. They are a proud and honorable clan that has recently purchased Tobago from the Lincoln station. Tobago picks up a servant over her head smiling about being a good choice.\n\nWe are one of the biggest buyers of the Lincoln station but we don't work with Slaves. The shimana clan is after great warriors of legend. They needed her help to reach a target and after she was free to go. There is a warrior that has escaped their grasp for many years. He points to a big moon in the sky and claims that the target is there but they have no way of reaching him. \n\nTobago nodded and took a big sip of the juice. Assuming she understood, Botan ejected her butt naked towards the moon a servant ejecting her clothes and gear with her. She got dressed as she flew towards the moon which was more of a little asteroid. She heard faint footsteps as if someone was circling the asteroid to stay away from her. She raises her fist and breaks the rocky surface of the asteroid moving it off its orbit impacting another asteroid causing whatever was on the other side panicked and ran towards her. Turns out to be a regular wolf. She tries to grab it but it ran away causing her to fall off the asteroid","mpacting another asteroid causing whatever was on the other side panicked and ran towards her. Turns out to be a regular wolf. She tries to grab it but it ran away causing her to fall off the asteroid and landed on the other one she jumps off of it and lands on top of the wolf pinning it down. They weren’t fighting though. Johnny noticed a big spaceship built to look like a Japanese temple. Servants on its deck watched Tabaga wrestle the wolf. Chimer steered the ship closer as Johnny and I rolled our eyes. A gong sounded when we got too close. Someone spoke in a language that we do not understand. I cast comprehend languages and heard them say to stay away because this belongs to the daimyo. We convinced them to let us go to assist Tabaga. They agree as long as we leave what the wolf is guarding. We jump on the asteroid and talk to the wolf. He says that the moon was his friend and that he was guarding him. \n\nWe convince him that we were strong and that we could protect them both. The wolf agrees to join us and we all get back on the ship. The moon starts to shrink, turning into a tall skinny man in a pinstripe suit. His head was a crescent moon. He looks around surprised noticing the Shemana ship panicked and tried to swim towards us not actually getting any closer we rush towards him but a single person pod gets launched towards us revealing Botan in full samurai gear wielding A katana. The servants start to play music as we challenged him for the moon man. He lands on our ","ds him but a single person pod gets launched towards us revealing Botan in full samurai gear wielding A katana. The servants start to play music as we challenged him for the moon man. He lands on our ship taking a defensive stance. I cast calm emotions trying to stop the fight but his will was too strong, I tried to boost Chimer and Tabaga but Chimer is too strong headed but I was able to protect Tabaga from being charmed. Johnny moves to a strategic location and shoots at Botan who takes great offense. Tabaga attacked him but missed he was too swift. He moved faster than I can see landing in front of me his hand on his Katana. It took everything in me not to pee. Chimer instinctively came to my rescue kicking him away from me then bonking him with his staff, knocking out a tooth. Botan turns around attempting to say ah finally a real warrior but gets interrupted by Chimer who loses it and attacks again knocking him down. Botan stood up spat out blood and attacks Chimer hitting him but when he swings at me I ducked under his attack and tried to tell him a joke but he didn't find it funny he swung at me again but missed again. Johnny stepped up \n\nPut up his gun and shoots him pushing him away from me and Chimer. Tabaga rushes him but he ducks out of the way. He turns his back to Tabaga as if not taking her seriously. She takes the opportunity to attack him pushing him back towards me and Chimer. Chimer jumps up and attacks him knocking him prone. Botan gets back up and tries t","abaga as if not taking her seriously. She takes the opportunity to attack him pushing him back towards me and Chimer. Chimer jumps up and attacks him knocking him prone. Botan gets back up and tries to dual wield towards us we put up our guards but Chimer blocked him but I received a big slash dropping me. Johnny steps up and attacks growling frightening Botan as he shoots him again pushing him back towards Tabaga. Who grabs him expertly putting him in a half nelson. He tries to swing towards her but she was too tough. Chimer attacks Botan with a big magic attack leaving him exhausted. Botan stabs his sword into his stomach summoning four spirits who scramble to hit Tabaga and Chimer but they were too swift evading the attacks. Johnny fired and missed burning some of Tabaga's clothing. Tabaga tries to choke him out. Chimer stands up and tells him that I hope your honor was worth this before he cast a big lightning attack that explodes his head!!! He falls between us as the servants stop playing music. They put their hands up and retreat. \n\nChimer claimed his sword as a trophy and his full plate samurai armor. Chimer handed his body back to his people who asked for the armor as well so that they could bury him in it. \n\nThey told us that we were noticed by the Shimana Clan before they left to tend to the dead body.\n\nChimer healed me by kissing me softly on the forehead. I sat up as they all\n\nChimer's witchbolt gave him distress apparently he had accidentally killed his childhoo","hey left to tend to the dead body.\n\nChimer healed me by kissing me softly on the forehead. I sat up as they all\n\nChimer's witchbolt gave him distress apparently he had accidentally killed his childhood pet with it and \n\nThe moon man bowed and clamped his hands together the wolf turns to us, thanking us profusely. The moon man does a second more theatrical bow throwing a tarot deck in the air grabbing a card out of it. It was the moon card. The wolf says I am Mr. Moon I want to thank you for helping me and my little friend. I am a wizard of sorts you see and the Shimana Clan has been chasing him for his fighting prowess. He was a reverse werewolf when I see a full wolf I turn into a moon. Chimer invites them to travel with us. The moon man flourishes his coat tails so the wolf translates that into meaning that he didn't want to burden us as the moon man whips out a tray of tea and serves us all. It was decent tea. He asked us to take him to Cupie, the planet of love, it was on our way so we agreed. The moon man told us about the Shemana Clan as he headed to the kitchen and started making something that smelled like vanilla. Chimer asked him questions about his hometown. His planet no longer exists and he was the last of his species. \n\nHe asked about Chimer's species who told him that he himself didn't know. Which prompted Johnny to turn towards me and call me out for being a changeling. I admit to it and explain that I only hide it because I face racism. I try to talk Johnny i","hat he himself didn't know. Which prompted Johnny to turn towards me and call me out for being a changeling. I admit to it and explain that I only hide it because I face racism. I try to talk Johnny into signing a retainer but he refuses. I gave him the paper to keep. We ask about the wolf, the moon man tells us that the wolf is actually a familiar so we asked him if he wanted a name, Chimer suggested Snoopy, the wolf suggested the destroyer of a thousand worlds, so we settled on Snoopy the destroyer.\n\nMoon man made vanilla cake and asked to rest so he retreated to my room to sleep because Johnny invited him to it, I shot Johnny a . \n\nChimer asked him for a souvenir so he gave him a tarot card with a phone drawn on it he explained he could tap twice to reach him. I gave him my business card as a way for him to reach us. \n\nShocking grasps once a day. \n\nWe arrive near planet Appatia big beautiful and divided in two hot and cold. There’s a thin vibrant blue strip of water between the two. in the top section where it's cold there are cities. There is a space station following the planet. There is traffic between the cities and the station. As we approached the Solar police sent us a signal. we respond and they ask us to pull over they park behind and infront of us and one of them steps out and somehow walks over to our window in mid air. They searched us and checked the ship's registration and Chimer's license finding nothing suspicious. They asked us about a report that came in ","ps out and somehow walks over to our window in mid air. They searched us and checked the ship's registration and Chimer's license finding nothing suspicious. They asked us about a report that came in from the Lincoln station and the oddjobers ship. We convinced them that we escaped the attack on the oddjobers ship and arrived and left the Lincoln station before the rebels’ uprising. Not finding anything to stop us so they warned us to register the vehicle to our name before they left.\n\nCupie\n\nWe arrive at Cupie it looked like two planets merging into each other into the shape of a heart!\n\nTabaga moans and wails about being home sick apparently Cupie was her home planet. She informs us to approach the planet from the arms of the hearts. We land and Hui hacks the parking Meter as I distracts the people around by making a scene around Jhonny then transformed into him and we both started signing autographs. People crowd around us including a bunch of Hiku fans wearing blue wigs she is a virtual musician biggest in the solar system. Posing as Johnny Mythrilhand cosplayers we manage to distract everyone but Hui still gets spotted by a street urchin selling water. Who asks him if he would like water. Hui has to bribe him by giving him a fake lucky Lincoln coin. The kid skips away happily. \n\nWith our ship parked and the crowd around us dissipated. \n\nWe go to register the Marlin. A lady with big glasses at the counter gave us the forms to fill out. Hui fills out the \n\nA card gets prin","y. \n\nWith our ship parked and the crowd around us dissipated. \n\nWe go to register the Marlin. A lady with big glasses at the counter gave us the forms to fill out. Hui fills out the \n\nA card gets printed out and laminated. I put it in my wallet. \n\n The moon man walks out and shakes our hands warmly as his wolf thanked us telling us that they are going towards the ribbons, if we even needed them, they would be there. The ribbons are the big constructs that hold the planets together, there was the nightlife sin city scene.\n\nWe say our goodbyes and they leave on the train. We get on another ship that shoots all the way down to the blue planet, the one that Tabaga is from. \n\nIt was a very dense jungle that gets urbanised at the center tapering away into jungle the further you get from the center.  A strange smell of freshly rained on soil lingered in the air. The people seem to be more robust here, mostly made up of Orcs but you still find some goliaths and stuff.\n\nTabaga takes us to her home. As we step out of the station we notice that all the houses are elevated in some way, some on stilts some held up by these strong trees. It seems suburban but the level of technology was high. The cars were self driving, we hail one down that drove us 10 mins away from the station until we arrived.\n\nAll the houses were overgrown and boarded up. They have been abandoned for a long time. It was a decent sized place, seemed to not have been broken into but everything is dusty and moldy and in ","ved.\n\nAll the houses were overgrown and boarded up. They have been abandoned for a long time. It was a decent sized place, seemed to not have been broken into but everything is dusty and moldy and in a terrible state. Tabaga walked in kicking up the ancient dust picking up and image of her being held up by her parents wearing a wrestling mask two sizes too big on her with their arms raised in victory. Tabaga smiles at the picture and steps into the bathroom to check if there is running water, finding it had been out for a long time. We ask her about the house and she tells us that she hadn't been here since she buried her father two years back. As a wrecking ball came crashing through one of the walls. We scrambled outside as a man in a hard hat approached us screaming about the place being condemned. Tabaga was screaming inaudibly at the poor man who introduced himself as Marcus, a friend of her parents. He apparently knew Tabaga from when she was a baby. He greeted her warmly but Tabaga burst into tears and ran outside as Marcus apologized flustered. Tabaga running away runs into an advert of Goldstein, her arch rival advertising a dating app called Cupid's arrow which was a rival to her parent's dating app. Feeling sick to her stomach at the sight we approached her. Hui looked it up and found that Cupie's main export are these dating apps with their marketplaces, and Cupid's arrow is one of the biggest ones. Tabaga throws a tantrum I pretend to not know her as I tell her t"," it up and found that Cupie's main export are these dating apps with their marketplaces, and Cupid's arrow is one of the biggest ones. Tabaga throws a tantrum I pretend to not know her as I tell her that we needed to go back and deal with her house situation because Johnny is stalling and he gets bored quickly. Tabaga tantrums back to her house where we find people picketing with hearts and peace signs. She flings one of them out of her way heading towards the people in the hard hats we pass by someone smoking a cigarette. Someone had put a crown of flowers on a glowering Johnny. Tabaga having grabbed a peace sign slams it on Marcus’ head leaving him shocked but fine seeing that he was wearing a hard hat. He looks at her sheepishly. I can tell you're upset, he says\n\n to her. She growls in response and not wanting to get their asses kicked they left. Tabaga put her hands up in succes met with disapproving looks from the peaceful picketers. She exclaims Goldstein and Cupid's arrow, you are next. The crowd took videos of her saying that and sent them around. It came back to Johnny through the social media outlets  that Goldstein was on the planet because he had posted from a hotel there that morning. \n\nFirst thing's first Hui and I went to get the paperwork on Tabaga's house cleared. Bob the blob looked up the rules of the wrestling federation. There was a duopoly of these wrestling promotions and the one that survived was the league named the fighting association r tournament f",". Bob the blob looked up the rules of the wrestling federation. There was a duopoly of these wrestling promotions and the one that survived was the league named the fighting association r tournament fart for short. And later became.\n\nIn the heart spire pavilion we walk into the mayor's office that has the esthetic of both the planets à la solar punk. \n\nWe are greeted by a receptionist who Hui floods with papers barely giving her time to respond. She points us towards a machine that Hui goes over to file the forms. I stay behind talking her up. The AI introduces itself as Aphrodite. Hui gets the sense that this AI is extremely well developed; it is the governmental AI that runs everything on the planet. Hui surpassed its checks for the paperwork.  But he tried to establish a back door to the system but failed so miserably that the terminal exploded, hurting him in the process. I ran over putting on the performance of my lifetime. The guards having burst in prepared to fight but met with the sight of us screaming in despair quickly scrambled to contact medics. The receptionist gives us a healing potion, I thank her warmly and we get escorted into the Mayor's office. A tall black human woman greeted us smiling sitting in front of a painting of herself with the same expression on it. Warm welcome invites us to sit down. A canned audience as I tell her about the incident. She tells us that it was unfortunate as the audience awwws and ooohh I start to take over the “show” and stran"," Warm welcome invites us to sit down. A canned audience as I tell her about the incident. She tells us that it was unfortunate as the audience awwws and ooohh I start to take over the “show” and strands of her perfect coiffe come undone. Hui and I pulled a bunch of shenanigans ending with my massaging her shoulders to calm her down and she screamed frantically that she needed to introduce the contestants. We didn't let her do any of that. As I massaged her shoulders I was casting an identity spell on her wig. It turned out to be a conjured spirit. They weren’t supposed to last days but this one has. That's why she hasn't slept for days! I grabbed it and tried to yank it off of her head..\n\n\n\nYoung lady in round glasses drops her papers and her books saying how clumsy she was bending over to pick them up. Chimer kneels down to help her and uses her druidcraft to make flowers bloom around them. She blushes and introduces herself as Hillary. She was shy but invited him to find her at a club in the ribbon that her and her friends will be attending that evening. Bob, still disguised as a cat hisses at her. \n\nThey make their way to the mayor's office to find Hui and I yanking the hair off of a lady's head. \n\nShe calls security who jumped up at us but we convince them to help us pull the wig off. Hui identified that this thing was a very strange conjured spirit. A spirit that accompanied the wielder and buffs them but if left on too long will become parasitic. Which is what is happen"," wig off. Hui identified that this thing was a very strange conjured spirit. A spirit that accompanied the wielder and buffs them but if left on too long will become parasitic. Which is what is happening here. Johnny typically pull out his gun making the situation tenser. Hui and I as if in sync southe both the mayor and her hair. The mayor flashing with sudden clarity rips the hair off her hair as I catch the unconscious mayor in my arms like some fairy tail prince. I think doves flew even. The hair scurries into a corner Hui sends New three to grab it.\n\nShe kicks the secretary and the two guards Jeffery one and jeffery two out of her office. She straightened her jacket tries to straighten her wig realizing that she wasn't wearing it anymore. She snaps her fingers and the wig disappeared in a puff\n\nShe thanked us and Johnny put his gun down and accepted her thanks. She explained that you can get your own spirit from the ribbon. It can buff whatever you want. Hers buffed her ability to speak and her constitution but she left it on for too long and lost herself. \n\nShe pulls out a dating app called cupid's arrow and shows us that in the marketplace of the dating app there is a section that sells these spirits. \n\nHui asked about the collection of the Data. She explained that Cupid's arrow was the one that collected the information and shares it with the government. And that Aphrodite was the AI in common which made Hui and Johnny uncomfortable. \n\nWe thanked the mayor. She agreed"," arrow was the one that collected the information and shares it with the government. And that Aphrodite was the AI in common which made Hui and Johnny uncomfortable. \n\nWe thanked the mayor. She agreed to process our paperwork and I gave her a business card before we left.\n\nWe stepped outside and the birds were quiet I asked the guards if it was normal and they said it wasn't. \n\nI knock on the door and a tiered looking woman opens the door with a xhain still on she asked us if we were here to view the house\n\nThe place was filled wall to ceiling with many many clocks not a single one was working in sync. \n\nShe brings us cookies and tea and brings a vase and sits telling us that she inherited the house from an uncle of hers. Him and his bride still haunt the place which is making it impossible to buy \n\nThey appear at midnight. They appear at midnight and stand there looking into each other's eyes before disappearing. As she spoke the vase of flowers she had brought was completely rotted. The cookies had gone stail. She signed our contract without even looking at it and I got up throwing salt around as an excuse to investigate. This seems to be a real haunting. Hui cast detect magic and found that there were three points of interrst but he didn't \n\nThree rooms on the GF a living room a kitchen and a bathroom and two upstairs a master bedroom and a guestroom\n\nWe investigate the master bedroom. A large king size bed with a mosquito net a big dressing mirror and a little bathroom.\n\n"," a kitchen and a bathroom and two upstairs a master bedroom and a guestroom\n\nWe investigate the master bedroom. A large king size bed with a mosquito net a big dressing mirror and a little bathroom.\n\nI look at myself in the mirror, I was quite handsome. Hui on the other hand noticed a trail of papers on the windowsill through. The window was jammed shut but Hui cast mending on it and opened it easily, I felt foolish with a rock in my hand. Hui uncrumpled the paper and found the beginning of wedding vows:\n\n\"I vow to find you in every life, in every shadow, in every breath between worlds.\n\nI vow to remember your name, even when the stars forget mine.”\n\nHui noticed a blockage in the chimney because the smoke went out of one side.\n\nWe try to throw Hui into it but he overshot and went crashing out a window. The lady screamed about trying to sell the place so Hui had to spend time fixing the window piece by piece.\n\nI turn off the fire and reach into the chimney \n\nAnd pull out a charted journal with the other part of the vows:\n\n“I vow to wait, whether it takes a lifetime or a death.\n\nWhere you go, I follow. Where you stay, I haunt.”\n\nJohnny went to smoke a cigarette. He watched a large orc walk up to a phone booth and speak to the AI Aphrodite.  He followed where the wires went and found that they converged at a hub located next to the house.\n\nJohnny makes Hui turn it off\n\nWhen that happens all the clocks synchronize and hit 12 and a man and a woman appear and reach towards each oth","d that they converged at a hub located next to the house.\n\nJohnny makes Hui turn it off\n\nWhen that happens all the clocks synchronize and hit 12 and a man and a woman appear and reach towards each other but they couldn't reach as if the signal wasn't strong enough. The digital space has every site that we have been using.  That digital space has to exist somewhere. Johnny and Hui nerding out about the ethereal plane that has been taken ooverand turned into the digital plain but the ghost caused a huge glitch and Johnny gets the impression that this is why the digital space has become a wild place full of rogue AI. \n\nI showed the lady the papers with the vows and turns out she had the last one:\n\n\"I vow to find you in every life, in every shadow, in every breath between worlds.\n\nI vow to remember your name, even when the stars forget mine.\n\nI vow to wait, whether it takes a lifetime or a death.\n\nWhere you go, I follow. Where you stay, I haunt.\n\nThis love is not bound by time, by flesh, or by fear—\n\nIt is the one thing that will never die.”\n\nShe agrees to move his body and Hui and Johnny disable the next door machine and we thank her she signes and asked for \n\nWe make 300 gold pieces. \n\nWe hear the sound of a man going weeewoooo weeewoooo weeewwooo fred flinstoning cop cars. They were Orcs wearing ill fitting cop uniforms. They arrive still going weeeewooo weeeewoooo doing combat rolls when not necessary.  I screamed oh no they went that way as Johnny agreed while twirling his g","re Orcs wearing ill fitting cop uniforms. They arrive still going weeeewooo weeeewoooo doing combat rolls when not necessary.  I screamed oh no they went that way as Johnny agreed while twirling his gun the orcs thanked us and took off in the direction that I was pointing. \n\nTabaga sitting in her old house putting her things together. She stepped outside and noticed a large black car parked with tinted windows. A man wearing a nice suit has sunglasses stepped out. Tabaga grabbed a rotten apple off the floor looking at it as if she was going to eat it and threw it with great skill at the secret agent looking man splattering exploding all over his face. The man called out that he is a representative from Cupid's arrow I am looking for miss Tabaga I have an invitation to deliver. Tabaga took the now apple covered invitation to a big ball held by the Cupid's arrow people and guests of honor were Goldstein and Tabaga herself. Tabaga looked up and asked if she could bring us with her. He said that she was the guest of honor so sure. She accepted the invitation. As the messengers as she snarled and growled left relieved \n\nChimer's Frill phone begins to ring. A voice spoke through a bad signal. Old man McCree asking about his progress on locating the lucky Lincoln. He said that he had a perfect replica with a better story attached. Old man McCree questioned him about joining the army and gave him news of his father. They spoke like family would and ended the call lovingly.\n\nChimer to","perfect replica with a better story attached. Old man McCree questioned him about joining the army and gave him news of his father. They spoke like family would and ended the call lovingly.\n\nChimer told us about the girl that flirted with him and about her invitation to a night club HUI looked it up and found that it was a techno bar. Chimer \n\nTabaga \n\nBob's phone rang; it was from his spy network. It was Elizabeth, his handler. They exchanged pleasantries as he stepped away from us to take the phone call more privately. She gave him two targets: A DJ named smooch.exe that just so happened to be performing at the club where Chimer was going. The orders were to ruin his career or alternatively murder him. He informed her of the washing machine god that they had created back on the Lincoln station. She asked permission to exploit it. Another target was a wrestler named Tabaga that needed to be executed publicly at the event that she had been invited to. Bob took the job so that no others would. He was planning on failing it. \n\nBob asked HUI to make him a small device to take over a sound system. He made him a dooheeky. Bob went and asked Johnny for a bit of his music that he recorded on a data crystal. He made a Playlist of his most mainstream songs. \n\nWe all get dressed up, I help the men put on ties. Chimer gets dolled up \n\nWe take the train to the ribbons where the hub of the city is located, restaurants clubs shops people it all bustled. The tubes connecting the two planets"," the men put on ties. Chimer gets dolled up \n\nWe take the train to the ribbons where the hub of the city is located, restaurants clubs shops people it all bustled. The tubes connecting the two planets were so big that they had their own atmosphere on the top level nightclubs lined the tubes all cloud themed.\n\nWe walked through the pedestrian streets with cars flying above us. Tabaga told us of the old shops and bars that were there in her childhood that she used to frequent. She noticed that there were neon signs that say spirits, we have spirits here.. etc. \n\nTabaga and Johnny walk into a cosy little dive bar it had a good amount of people in it. Some rougher looking than others but everyone seemed to be minding their own business until people started to recognize the pair. I walk in changing my appearance from table to table trying to \n\nA big burly man walked up to them claiming to be a fan asking for an autograph Chimer and I asked for money but Johnny gave him one for free so Tabaga stabbed herself in the shoulder with his pen and used it to sign an autograph with his blood. The burly man and I walked away horrified. I just left the bar. Johnny and Tabaga stayed behind to order drinks, the bartender offered them a spirit that they accepted. He pulled out a spectral looking bunny thing. Tabaga and Johnny stared at this thing exchanging looks. Johnny claimed to have enough voices in his head as he trailed off arguing with the voices in their heads. Tabaga accepted it offeri","nny thing. Tabaga and Johnny stared at this thing exchanging looks. Johnny claimed to have enough voices in his head as he trailed off arguing with the voices in their heads. Tabaga accepted it offering her cleavage to the bunny. It jumped into her cleavage and curled up Tabaga felt that \n\n\n\nHUI walks into a shop that says machine parts to satisfy your every need full of mechanical parts.. Many of them were sexual. HUI retreats promptly, but is stopped by the shopkeep that offers to help him look around. HUI retreated explaining that he had misunderstood what types of needs the shop was advertising. \n\nI ran into HUI as we both looked at each other dejected. I asked if he would like to help me swindle some people. He agrees and we post up shop and pretend to be advertising a futuristic robot we made 60 gold. \n\nChimer walked into a coin shop. There was one of those machines that imprints onto coins he imprints ten coppers with the words fine wine. In one of the displays there were 3 coins with strange inscriptions. Chimer recognised the patterns on the coins that look like the patterns on the artifact Johnny had found they seem to be from the March. He asked the shopkeep about the coins. He told him that these were expensive artifacts from another time before the great collapse. Chimer offered a replica of the lucky Lincoln in exchange for the coins in the case. The man looks it over and expresses his concern about the authenticity of the coin. Chimer calls me over to inspect t","imer offered a replica of the lucky Lincoln in exchange for the coins in the case. The man looks it over and expresses his concern about the authenticity of the coin. Chimer calls me over to inspect the coins I come and sit in the man's chair and look over the coins. I discovered that the items themselves weren't magical but there was some sort of magic residue. Given the age of the coin it was a ridiculously powerful conjugation spell from thousands and thousands of years ago. Chimer notices something strange: it didn't look to be man made. The circular shape is erosion. It seemed to have been shaped like a tear drop but with a rounded top. \n\nBob sneaks into the nightclub that Chimer was going to have his date in. It was called heart sink dates. The bars sold spirits and alcohol. There was a big stage being set up and employees were running around setting up the venue for the DJ set tonight and some people were already drinking. Bob sneaks his way under the stage. He hears a voice saying what do you mean those speakers can't handle our requested volume.? You must get me \n\nHalf his head shaved half painted blue. purple suit open to show off his chest hair. He plugs in his wires speaking to his machines like beloved pets. Bob plugs the sabotage equipment into the machine unnoticed, connecting the rock music crystal. He received a notification from an app that he had never installed on his phone. It said Cupid's Arrow: you have one match. He went to uninstall the app but there ",", connecting the rock music crystal. He received a notification from an app that he had never installed on his phone. It said Cupid's Arrow: you have one match. He went to uninstall the app but there was no uninstall button. Bob sneaks into the bathroom breaks his phone in half and flushes it down the toilet. Gets himself a burner phone and is set up to sabotage the performance tonight.\n\nWe went to the Ball I made sure to have a new face on. We walk out of the self driving cars all of us in suits and Tabaga in her wrestling outfit. We ascent in a glass elevator arriving to an eruption of Cheers as people greeted Tabaga warmly. The crowd parts revealing a large man wearing a suit he barely fits in with a white goatee and a big booming smile. \n\nTabaga smashes  her drink in her hand as she screamed Goldstein!! Goldstein laughed that she needed another drink People started ripping off their fancy clothes revealing wrestling uniforms underneath. They started putting on masks and performing \n\nGoldstein sign my baby he says of course as I hand him Bob. He signs Bob's forehead.  \n\nHe didn't notice bob grabbing things from his pockets. We retreat back to the bathroom where we found two men wrestling. I pretend to body slam one of them out of the bathroom claiming that they have no business in the ladies room he helped me throw him out as it was all pretend wrestling. They politely leave \n\nGoldstein was wearing a bullet proof vest he got his car keys and a microchip. HUI joined us and ","s in the ladies room he helped me throw him out as it was all pretend wrestling. They politely leave \n\nGoldstein was wearing a bullet proof vest he got his car keys and a microchip. HUI joined us and studied the microchip. It apparently it's something that identifies whoever is holding it is identified as friend. We walk out of the bathroom. Goldstein walks up to Tabaga and tells her to call it a quits on the rivalry, work together, and let bygones be bygones. Tabaga told him to go fuck himself. That they were screwing her family's app over. Goldstein told her to at least talk to his boss who was just arriving, he was gnome wearing an old suite he had many cybernetics and glasses that did nothing to hide his eyes rolling. He also had a spirit perched on his shoulder.  Goldstein took Tabaga over to introduce her to him. For the first time Goldstein didn't stand tall and confidently as he spoke to the boss. The boss greets Tabaga who answers with disdain. He offers to make some sort of collaboration with Tabaga. He offers to give Tabaga Goldstein's current position as Cupie's Cupid's arrow representative downgrading Goldstein to his home planet the March. The Boss orders the waiters to bring everyone drinks. Bob disguised as a waiter gives her the drink with the microchip in it. The Boss grabs a drink smashed it on a waiters head as everyone cheered and drank and smashed their glasses in celebration. A gasp is heard in the crowd. A man in the crowd immerges wielding a demonic g","e Boss grabs a drink smashed it on a waiters head as everyone cheered and drank and smashed their glasses in celebration. A gasp is heard in the crowd. A man in the crowd immerges wielding a demonic gun he pulls the trigger and Goldstein jumped and put himself between the two of them getting shot right in the chest the assailant fires again it looked to be aimed at Tabaga but it curved around her and hit the CEO exposing wires. He was a full on Robot. \n\nTabaga faked dying. Assailant runs through the crowd Johnny and I chase him but he gives us the slip. Security started scrambling between the people. Bob still a baby in my arms shows us the car keys he tosses them to Johnny I turn into a nurse and Bob pretended to be a stretcher. We took Tabaga and Goldstein from under the medical team's noses and we made our way to the underground parking \n\nJohnny sits in the driver seat revving the motor as we all piled into the car and drove off. We woke Goldstein up. Tabaga slammed her fists on his chest as I cast healing words. He sat up swearing that it was supposed to play out in a way where he saves Tabaga by jumping in front of the bullet as a motorcycle appears in front of us. Tabaga told him to shut the fuck up and punched him in the face. We recognise the rider as the assailant, “run his ass over” shouted Tabaga. Johnny driving like a pro avoided the barrage of bullets that the assailant was throwing at us. Goldstein shouted about not ruining his car but Tabaga stuck the rental st","his ass over” shouted Tabaga. Johnny driving like a pro avoided the barrage of bullets that the assailant was throwing at us. Goldstein shouted about not ruining his car but Tabaga stuck the rental sticker on his forehead as a response. Johnny shot at the assailant causing him to swerve but he saved it. HUI asks about Miew 3 who as if on queue came bursting through a wooden fence and ran by our side. HUI hands a vial of this weird fluorescent red liquid to Bob asking him to dump its contents into the gas tank. Suddenly the car accelerated at a great speed Miew 3 had to grab onto the bumper of the car to stay with us. Tabaga binded Goldstein's hands and feet, telling us to get the assailant alive if we can. Chimer's tattoos lit up and he hurled a bolt using his crossbow at the assailant, but he dodged it. Tabaga taps Johnny on the shoulder telling him to drive up next to him. Johnny got as close as the car could, it being a luxury car not really built for speed. Tabaga took off her wrestling helmet and smacked the assailant with it cracking his helmet. Tabaga climbed on top of the car, her braids coming undone in the wind. Tabaga threw herself in a weird wrestling move connecting her stomach to the assailants' stomach, launching them both into a truck filled with pillows. Johnny pulled the handbrake I started singing nervously Miew 3 planted his feet in the ground to help slow us down. But it wasn't completely enough as we slammed into the wall! It hurt. Like really hurt. We w","ulled the handbrake I started singing nervously Miew 3 planted his feet in the ground to help slow us down. But it wasn't completely enough as we slammed into the wall! It hurt. Like really hurt. We were all banged up but still alive. Goldstein was unconscious. People helped pull us out. Tabaga drags the assailant that she had captured towards us. She knocks him out with a single punch. The people seemed to have healing potions, what an odd planet. We started hearing the wooooweeee woooweee of the orc police! Tabaga suggested that we should escape. The people around told us that it was a bad idea. But Tabaga wanted to question the assailant before we handed him to the authorities. We take off running into the city scape. Tabaga with Goldstein on her back screams that we were close to where Chimer had his date. She leads us to the bar. We sneak into the back alley. Deliveries went into the back door where a security guard was stationed. Tabaga wrapped Goldstein's face and asked to be let into the whipping room but the security guard asked us if we were okay, Tabaga told him to let us through but he wasn't convinced, he rung up the manager who came and told us if we were in trouble we could clean ourselves up we thanked him as we entered. We asked if there was a private room we could use, I pretended to be the manager of these celebrities that we had with us. The Club manager wearing a gimp mask graciously offered us one of the rooms. Bob jumped up into the vents and vanished. ","ld use, I pretended to be the manager of these celebrities that we had with us. The Club manager wearing a gimp mask graciously offered us one of the rooms. Bob jumped up into the vents and vanished. In the club a group of girls arrived, Lilly Chimer's date was between them. They head to the bar to get drinks, Bob snuck towards the bartender who was doing lines of coke in secret. Bob preached that the dishwasher god disapproved of his behavior and that he should repent. He passed out and Bob disguised himself as the Bartender. The girls asked for shots and he preached the dishwasher god psychically into her head. She looked up and panicked, her friends tried to calm her but she ran out of the bar and her friends chased her out. Bob sent us shots up to the VIP room. \n\nWe woke up the assailant first we had him tied to the chair he looked left or right, noticing where we were as he begged us not to do anything to his butt and promised to talk. Tabaga asked who he was targeting tonight, he said that she was. She asked him who hired him and he said that he acted on his own behalf. Tabaga drank a shot and placed it on the assailant's head. Tabaga grabbed one of his fingers and flipped it back until it became tight looking menacingly at him as if saying I'll break it. He lied so Tabaga broke his finger. \n\nMy love's calculations told me that you would be smart enough to steal the friendly chip. Tabaga broke another finger as he screamed. I intervened and pretended to be “the good cop","broke his finger. \n\nMy love's calculations told me that you would be smart enough to steal the friendly chip. Tabaga broke another finger as he screamed. I intervened and pretended to be “the good cop” winking at Tabaga to give me a turn.  As we interrogated the assailant Johnny stepped out and saw Lilly and her friends running out of the club. He immediately noticed that the bartender was Bob and tried to intercept the girl running away. He told her that he would have seen you before. In the back of her mind Bob told her “he has seen your sin”. She told him that she is crazy and she is hearing voices of the dishwasher god. Johnny looked at Bob with a smirk and comforted her telling her that the voice is some dude using telepathy. She understood and went to throw a drink in Bob's face who left the Bartender's body, it collapsed to the ground as Bob says in her head you killed him! the girls scream.\n\nI talk to the assailant who tells us that it was the AI Aphrodite was the one that put him up to it promising to give him a gold membership hiring the chances of him finding his one true love.\n\nI grabbed Goldstein's phone, he had the app but no account. I made him a fake account using an old picture. I talked to customer support, it was Aphrodite, I spoke to her pretending to be Goldstein. She told me that I should know that I was supposed to fake save Tabaga and become a hero. \n\nHui traced the call but couldn't find the source. \n\nGoldstein is against the spirits he's against dopi","tein. She told me that I should know that I was supposed to fake save Tabaga and become a hero. \n\nHui traced the call but couldn't find the source. \n\nGoldstein is against the spirits he's against doping. Tabaga is angry about Goldstein lying to her and wanting to put her family's company under. Goldstein swore that wasn't the plan, he apologized for his actions of the past but this time he actually wanted to help her raise her family's legacy and his own fame. Aphrodite put him up to it. Tabaga told him that they were now both dead to the public. Goldstein tells her he can't do that because people depended on him. Tabaga shouted about it being done! About how they were both targeted. Goldstein said he suspected it that's why he wore a bullet proof vest. He had been snooping around and asking questions about the spirits and was met with a lot of red tape. \n\nJohnny and Bob downstairs notices a bunch of black cars pulling up to the club. Upstairs Tabaga and Goldstein were arguing as we heard a gun fire from downstairs. Bob dropped the bartender again and jumped back into the vents and dropped all slimy and sludge onto Tabaga's head warning us about the situation downstairs. \n\nDJ smooch setting up his set ducks under his booth panicking. The group jumps in asking about Goldstein. The club manager stood in their way saying he wasn't there but they hit him with the back of their pistols, knocking him out as they scattered to search for Goldstein. HUI turned off the lights. Tabaga o"," club manager stood in their way saying he wasn't there but they hit him with the back of their pistols, knocking him out as they scattered to search for Goldstein. HUI turned off the lights. Tabaga opened the door, finding herself face to face with one of the attackers. He starts to raise his communication device to inform the others but Tabaga threw the assailant chair et all at him while letting out her war cry “Shamandar” knocking him out. Voices started screaming about following the noise. HUI turned the lights back on on full temporarily blinding our attackers and Johnny who was now hiding in the crowd. We all sneak by someone grabs HUI and turns him around pointing a gun at him. I took off my shoe and smacked him with it as Miew 3 takes advantage of the situation and crushes the gun. In the crowd Johnny gets turned around by a fan telling him that they needed to get out of here, to which Johnny agrees, as he turns back around he finds himself face to face with the attacker. He starts to raise his gun but Johnny was much swifter, pushing his fan out of harm's way and shooting the attacker in the head. We found ourselves outside all together. We hail a cab and commandeer the vehicle under the driver's swearing. We drive off towards the orc planet. Bob snuck towards the space harbor to check on the ship, he sees the urchin still loitering around it suddenly a figure steps out of the shadows and pushes the kid away. Bob snuck into a position and found people dressed incons"," harbor to check on the ship, he sees the urchin still loitering around it suddenly a figure steps out of the shadows and pushes the kid away. Bob snuck into a position and found people dressed inconspicuously but they had ribbons tied to the back of their heads. The waiters at the club also had those. I wonder what they are. Tabaga didn't know what they were but Goldstein told us that they were androids. An incredible inventor moved to cupie but now he quit he was the one that made them. Bob telepathically linked to me and informed us of the situation, he then tried to sneak up behind one of them to remove the ribbon to see what would happen. After twelve seconds they fall over. He sneaks away. We all agreed that we were going to take down Aphrodite. Finally Goldstein and Tabaga agreed on something.\n\nWe sneak towards an abandoned warehouse in the district where we took out a relay center for Aphrodite making this area a blind spot for it. HUI points out that the grass and nature that are taking over the warehouse are not normal grass, it's a fungus of some sort. A fly lands, dies and decomposes in a matter of minutes. That explains why all the houses were elevated!. HUI overexcited takes a sample. I make sure not to touch it anymore. \n\nGoldstein draws us a map of the building where Aphrodite is kept. He points us to the best paths to take, Bob asks where the bathrooms are. We discussed multiple ideas, when Johnny steps back into his head to speak with Alt. She sassed him as ","ere Aphrodite is kept. He points us to the best paths to take, Bob asks where the bathrooms are. We discussed multiple ideas, when Johnny steps back into his head to speak with Alt. She sassed him as always, and they argued which seemed to be how they communicated. He asked her what she thought of the situation, she expressed her surprise at there being such a sophisticated AI to begin with. She enquired about HUI. Wondering if he was human or an AI pointing out that he was cracking jokes. She told him that if we brought her close to Aphrodite she could discover more about her. She herself was interested in the locator. He came back from his trance and told us what he had been told.\n\nBob sneaks into the employee bathroom. And waited and waited, eventually he became suspicious and jumped into the vents and explored the whole area and found no one there. \n\nJohnny dressed as Goldstein and I dressed as Tabaga walk up to the front door we knock and the camera tilts down to look at our faces \n\nIn the reception the plants took us by surprise, they are feywild native plants Johnny and I exchanged looks he expressed thinking that whoever is behind Aphrodite is Fey.\n\nWe walk further in and are greeted by a little robot who was acting as if broken. He was glitching and telling us that there are special circumstances that will end at “redacted” issued by xxxx. We introduced ourselves as Tabaga and Goldstein so the robot said that they were expecting us. Aphrodite Told me to activate spec"," are special circumstances that will end at “redacted” issued by xxxx. We introduced ourselves as Tabaga and Goldstein so the robot said that they were expecting us. Aphrodite Told me to activate special protocols and opened two hatches from where two giant mechs came out. The little robot spoke: thank you for coming, now die. Johnny reacted first he straightened, pulled out his guns and shot, pushing back the one closest to us. He starts to climb the piano. They were from the March these mechs. I cast shatter. I fling a rock as hard as I could at the furthest robot breaking the glass parts holding in the magic core of the beast. I then ran as far as I could.  Bob came out of the bathroom and started throwing psychic daggers at the furthest mech who was still reeling from being shattered. The closest mech dashes at Johnny lifts it's arms and brings them crashing down on Johnny who I could swear grew another set of arms to block most of that damage saving himself from being crushed. HUI and Mewthree come rushing in, Mewthree grabs the statue at the door and flings it into the fight. HUI himself stepped up and threw fire into the ring but he didn't hit anyone. Chimer stepped up and attacked the red mech, the closest one, who took the attack directly and rushed to loom right next to me. A small spirit suddenly appeared next to our heads cussing us out floating from ear to ear screaming profanities. Johnny, recovering from the smash puts his gun up and shoots the blue mech, the f"," me. A small spirit suddenly appeared next to our heads cussing us out floating from ear to ear screaming profanities. Johnny, recovering from the smash puts his gun up and shoots the blue mech, the furthest one pushing it away and jumps up on the piano using it to kick up towards the second floor to get to Aphrodite. I shattered the red one again leaving it looking damaged. I inspire Bob who was standing next to me but that sunnovabich threw a single dagger and then ran back into the bathroom to save his ass.\n\nThe robot then walked up to me, lifted its arms and hit me twice. I, being just a regular person, obviously fell unconscious. \n\nHui tried again but he and Mewthree stumbled. The red robot turned around and cast a sickly green aura on HUI and Chimer. Hui started to slow down, Chimer was able to shake it off. He pulls out his witchbolt to hit the blue mech. Johnny jumps up and points his gun, strategically hitting the blue one moving it away from my unconscious body slamming into the wall, pieces and bolts falling out of it. I had a vision of a beautiful woman walking into my office with coffee asking if I was staying late. I told her I wasn't and invited her to dinner. She agreed and suggested a mom and pop pasta shop. We walked and talked until we reached the place that turned out to be closed and was going to turn into a galaxy bucks a big corporation. We looked down the alley where there are still little charming shops and in the background big skyscrapers were being","rned out to be closed and was going to turn into a galaxy bucks a big corporation. We looked down the alley where there are still little charming shops and in the background big skyscrapers were being built. Bob came back to the fight and attacked. The Blue mech swung back and hit Bob. Hui's turn he attacked and missed again. The big Red one swung at Mewthree who blocked it and moved it out of the way. Mewthree takes advantage of him moving but also misses. The mech swung at chimer who got hit directly. Chimer throws an attack at the blue mech who looked to be barely hanging on. Chimer then attacks the red one with his quarterstaff. Johnny flies at the blue mech finishing it off. It tries to lift its arms to deliver a finishing blow to my unconscious body but freezes from Johnny's attack and falls backwards. He then spins, attacks the red mech and jumps back up on the piano to the second floor. I got a vision of a month after the last one, the same vision of the beautiful woman handing me coffee and outside a crowd of protesters chanting against big corporations. It's crazy we spend so much time building up our homes only to have them taken away by these big corporations and asking me to try to do more. \n\nThank you for dying please come again one of Bob's throwing knives embedded in it turning it off as well.\n\nHUI healed me and extended his hand. I took it and sat up thanking him. Johnny yells back to follow him as he opens the door to a beautiful room filled with more fey pl"," in it turning it off as well.\n\nHUI healed me and extended his hand. I took it and sat up thanking him. Johnny yells back to follow him as he opens the door to a beautiful room filled with more fey plants, hiding wires and machinery all over this place. In the middle there was a pool where there was an altar or sorts. A strange Crystal stood in the middle of the room. Alt told Johnny that that was his target he pulls out the emp and throws it but it gets stopped in the middle of the air as if caught by something invisible and throws the bomb back at him exploding at his feet. His arm starts to come apart at the seams but it holds together. In front of us revealed three ghosts and what looks like a Banshee! That was Aphrodite!\n\nAphrodite looked to be a spirit that has been left out for way too long. \n\nBob reacted first; he threw knives at the ghosts closest. Chimer came in second and he also attacked it! Johnny came next a ghostly apparition split from him and started working on the machinery, he then turned and shot at the ghost as well. The ghost reacted and started clawing frantically heading for Chimer . I set off a cherry bomb distracting it so Chimer had just enough time to put up a shield so as not to eat that attack head on even if it did damage him. I ran towards the computer in the room. I opened it up and it was in some sort of code language. Praying that this would work I cast a comprehend language spell when trying to read the logs. I understand that everything wa","uter in the room. I opened it up and it was in some sort of code language. Praying that this would work I cast a comprehend language spell when trying to read the logs. I understand that everything was going well until 7 years ago the CEO’s wife passed away. He created this company in honor of his wife. I pull out a picture and it’s a short man dressed like a fisherman smiling and hugging a woman significantly taller than him that her face is out of frame. It was the same man that was shot during the attack on Tabaga, the one that turned out to be a robot. The picture has writing on it that says venus fly fishing with my venus. \n\nThe ghost on the left approached Alt and swung at her, who took a little damage . The banshee reveals her horrifying face. I felt a little weak in the knees but kept it together. Chimer commented about her appearance so she approached him but didn’t do anything else. HUI pushed me out of the way and was able to plunge deeper in the terminal. Distraught because of the death of his wife Venus, he made Aphrodite it was a very simplistic AI that couldn’t replace the real thing, he also found business dealing with the traveler on Planet Sulfur that dealt with spirits, there was a particular spirit he bought that cost him significantly more than the rest. And since buying that spirit the profits of the company soared. He passed away from natural causes two years ago making the new aphrodite go crazy and built herself a fake version of the CEO and invested ","since buying that spirit the profits of the company soared. He passed away from natural causes two years ago making the new aphrodite go crazy and built herself a fake version of the CEO and invested in a bunch of androids and robots from the march to protect her assets. Suddenly Bob grew a little, the Chimer grew so much he had to crouch to fit in the room, Johnny grew a little as well, I grew as much as Chimer making the space in the room tighter, Hui was fine, nothing happened to him!. Bob jumps into action, attacking the banshee, she screams in pain as it lands directly. Chimer tries to move, triggering an attack of opportunity from multiple ghosts because he was so big and obvious. He manages to block the hit from the Banshee but the ghost hits him. The Banshee runs her claw through his body making chills run down his spine. He bursts out of the room crashing his new gargantuan body to the server room. He casts an encoded thoughts spell on the servers, he blinks his eyes and for a moment he could see the digital space, the ethereal realm, he found himself completely surrounded by specters moaning in distress. It felt like a sea of spirits held back by a giant white imposing wall. He pushes his spell through the wall and it turns out to be password protected. The password was 5 letters long. He typed in the word VENUS it was correct it opened up and he was able to implant his memory and we all suddenly gained admin access on all our devices. Alt and HUI confirmed that the"," 5 letters long. He typed in the word VENUS it was correct it opened up and he was able to implant his memory and we all suddenly gained admin access on all our devices. Alt and HUI confirmed that they had full access! Johnny runs past the Banshee that swung at him firing at the ghost that was attacking Alt, hurting it badly. The most hurt ghost turned towards me but I diverted my gaze making it unable to control me. I saw the other ghost turn its gaze towards Johnny. I yelled back warning him so he turned away right on time to also avoid being controlled. \n\n\n\nI turned into her late husband causing her to immediately change her posture. As if a weight was lifted off her shoulders. I called her my love and comforted her with my presence.\n\nI am tired, she replied. Tears went down my cheeks. I assured her that I was back and that she could finally rest. She reaches her claw at an exposed blackened heart beating in her meager chest, crushing it and letting out a horrifying scream that I swear was going to give me a concussion if I hadn’t fainted. She looked up, arms still in her chest cavity as tears of light streamed down her cheeks as she disappeared. \n\n\n\nWe step out of that traumatic fight, I healed Bob and Chimer who were down as well as HUI \n\nAlt sends Johnny a file to his frill phone he opens up the link and gets rickrolled. And another link with a case file about the man named the traveler. Johnny identifies it as an archfey, there is no information about him but recently "," phone he opens up the link and gets rickrolled. And another link with a case file about the man named the traveler. Johnny identifies it as an archfey, there is no information about him but recently he has acquired a machine that makes these physical spirits out of the ethereal, he uses it for fey spirits but he used it for a human spirit with the CEO’s wife. Alt says there is something else here. It seems that the traveler and the CEO were on good terms so there is a lot here to work off of. She gives us geographic coordinates on Sulfur on the burning side of Sulfur. We all receive a notification telling people to delete cupid’s arrow because it is malfunctioning, lower on the notification we learn that there is a new religion in town surrounding a dishwasher deity with very little known more than that. In Appatia there have been revolts and protests.\n\nThe boys start to raid the space, I step  outside to check on Tabaga and Goldstein, when I suddenly hear an explosion and sirens start to blare. Johnny steps outside roused by the sound I point at the billowing tower of smoke rising in the distance. He calls a cab as we all climb into it with the server that HUI took, making the car drive slow. To the explosion my good man we tell him and he reluctantly takes us to go see the fight. We get closer and start to see a giant mech shooting lasers and getting thrown around. There was debris so the cab couldn’t take us further. He leaves as we clambered our way towards the fight. We","ht. We get closer and start to see a giant mech shooting lasers and getting thrown around. There was debris so the cab couldn’t take us further. He leaves as we clambered our way towards the fight. We find Tabaga and Goldstein in exoskeleton suits fighting a giant mech making a whole mess of everything. A large crack starts to form. I ran around warning the onlookers , they reacted as if they knew what to do either taking cover or holding on to the big poles. We mimicked them, but Chimer didn’t make it in time. I tried to help him and managed to grab him expertly but then we both floated out.\n\nAs we were flying, we caught a flash of yellow and blue saving all the people floating out. Suddenly a thud stopped our momentum. A young man in superhero spandex placed us softly on the ground, flew off and in a blink of an eye caught another 100 people. He blocks the crack with debris and slowly the backup systems come online restoring gravity. \n\nTabaga and Goldstein come and land next to us after having defeated the mech loudly proclaiming that they defeated Aphrodite and were then carried away as heroes by the crowd.\n\nWe were left behind too tired to chase anyone down so as to explain anything. But Mark stayed behind so we told him about what happened, he invited us to visit the hero core. The hero core was on the moon next to rodina. We tell him that we will make our decision after a good rest. But Goldstein comes back to take us to a celebration that they were throwing for the her","re. The hero core was on the moon next to rodina. We tell him that we will make our decision after a good rest. But Goldstein comes back to take us to a celebration that they were throwing for the heroes. While at the celebration Chimer shows Mark the lucky Lincoln and asked if he recognized the patterns on it he told us that yes they are sigils from the march. There are vaults that can be unlocked if we find enough pieces of the sigils to make a key. They are called the broken sepulchre. We can sell them for a lot of money to the right collectors or If we open the vaults ourselves we can become some of the richest people in the solar system.  We party all night.\n\nNext day we went to the coin shop to haggle for the three coins with the broken sepulchre markings. They were red while the pieces that we had were blue. We haggled with him for a long time and we finally came to an agreement and bought the pieces of the Marches. They were bigger than the lucky Lincoln, more like the one Johnny got from Mr Sasafrazz. Chimer appraised the katanas that he had gotten. Bob went off and did some shopping on his own\n\nThe next day we head to our ship no longer guarded by the androids we climb on board as Tabaga’s fans cry out to her and tell her to hurry back, Hui fixed the terminal he had hacked\n\nRodina \n\nA man sitting down in the middle of space and he is miming driving a car. You look closer and this man is in black and white he turns around and notices us, he mimes pulling on his steer","ked\n\nRodina \n\nA man sitting down in the middle of space and he is miming driving a car. You look closer and this man is in black and white he turns around and notices us, he mimes pulling on his steering wheel but his invisible ship crashes into us. We actually felt the impact. We yell back at him like hey watch where you’re going. He mimed opening the window and started shaking his first wordlessly at us.\n\nHe steps out of his little non existent vehicle and plants himself before us fists on hips. I step outside as an old woman and Bob is pretending to be my cat. Meanwhile Johnny and Hui sitting in the ship not being able to hear the conversation are pretending to have the conversation. Bob pretends to have been run over by the ship holding up a flower under my tearful laments, so the mime ran to help him \n\nRodina seems to be an earthlike planet. The barrier machine can be seen from space. Rumors say it sticks out of the atmosphere but it doesn't actually.  Around the planet floats a space station that looks like a roman hall with people wearing white wigs. We skip the moon where the hero corps was and make our way towards the planet proper. We get a call upon entry the local authorities \n\nAurora borealis everywhere,  a blue one touched our ship cooling down the hull as we entered the atmosphere. This planet looked very solar punk. With plenty of lush green gardens for the people. Johnny complained about how corporate everything on this planet was. Hui wasn't very happy about","d the atmosphere. This planet looked very solar punk. With plenty of lush green gardens for the people. Johnny complained about how corporate everything on this planet was. Hui wasn't very happy about that; to him this was an urban planning dream. Mechanical mittens grab our ship very very gently and are then taken just as gently to a parking spot. When we stepped out, there was no parking fee. Everyone here seems to be at least middle class. Everyone walks around with cybernectic augmentations and there is a decent amount of hustle and bustle for a parking garage. Signs and lines on the floor to lead you. \n\nHui wanted to see Gloria Slugbottom. Johnny asked Alt if she wanted to do anything here? She told him last time they were here they went to the aurora belt where there are floating restaurants. Putting her arm around him he was shocked that he could feel her. I walked up to her take her hand \n\nWhen she got access to the Afrodite system she found conversations with the traveler and they discussed how the fabricator works, using that tech she figured out how to be more solid. We step outside and find ourselves in a hanging garden on the sky scraper. People sat in the garden talking, eating, showing each other inventions, as if it was a big university campus. Johnny talked to Alt as we walked, she was much more present than she used to be but she seemed avoidant of sentimental subjects. \n\nDisguised as an old lady I asked the information booth about the locator piece so it as","t as we walked, she was much more present than she used to be but she seemed avoidant of sentimental subjects. \n\nDisguised as an old lady I asked the information booth about the locator piece so it asked me to wait while authorities arrive. I obviously run off and disguise myself as someone else. When the authorities arrive they take a printout of the picture of the old lady and go off to look for her. One of them clocks me and walks up to me telling me that I needed to be in my real form. It was a rule about shangelings and shapeshifters.\n\nWe take the monorail. Flying around we pass by a few districts, in the cart there is a screen thing with a morphing map. \n\nWe head straight to the barrier passing beautiful locations that we should visit if we still have the time. Arriving we pass by a shield that draws our names above our heads, Hui pulls out his letter that gets scanned and cleared us to enter. We took a ridiculously long elevator, taking us to what seems like a steamwork factory, it looked much older than the new machines that litter the city above. All the people here were generally more augmented than the general population outside.  A helper droid greeted us and told us that Gloria needs 15 mins . So we go to the cafeteria to grab food and wait. I get recognized by the CEO of GalaxyBucks. \n\nIntroduced me to the people at the table with him. We were looking to open a branch in our company. I work for galaxy bucks and I acquire locations under the umbrella of a charity","EO of GalaxyBucks. \n\nIntroduced me to the people at the table with him. We were looking to open a branch in our company. I work for galaxy bucks and I acquire locations under the umbrella of a charity for them to use for their shop locations. I accept it with the intention of breaking them from the inside.\n\nHui plugs into one of the headsets but doesn't have the password for it. He looked at the map on the machine and realized that there are 8 visible levels and 2 hidden ones. \n\nWe finally get escorted towards Gloria. Greeted by Edna Hui gets off his robot all excited. Close behind them we walk into the thick cigarette smoke that engulfs the office of Gloria Slugbottom. She was pouring over the schematics to the machine. She was wired up to a bunch of medical equipment. She takes us inside and closes the door. She tells us that there are two people who are allowed to be cloned in this solar system, Mark and her. This was the first time they did this to her. Edna turned out to be a clone of Gloria. I asked her how she feels and she said that her feelings are not important. She tells Hui that if the procedure doesn't go well, she wants him to take her place. He reluctantly accepts. She tells us of the Rebis Company and that they were determined to save the world. She tells us that the locator was actually a part of the barrier machine and that she is willing to give it to us if we acquire the rest of the pieces. \n\nThis whole place runs on contingency, and she wants HUI to take ","the locator was actually a part of the barrier machine and that she is willing to give it to us if we acquire the rest of the pieces. \n\nThis whole place runs on contingency, and she wants HUI to take her place, but she feels that currently he wouldn't be able to. That's why she wants us to go find the rest of the pieces, she promised to give us Alvido once we have the rest. Which will be difficult seeing that they are so desired.\n\nThe door knocks, Edna lets her in, in walks an angel with fire wings, he had a beautiful halo holding up an exquisite coiffe. He had to bend to walk through the door, so he introduced himself as Pailor. Bob twitched like he was someone important. He shakes all our hands leaving us a little suntanned and a little warm. Gloria introduces us as Hui's companions. He asked her to speak to her in private. Suddenly Johnny lets Alt out, taking Pailor by actual surprise.  Bob noticed that he tensed up, he's probably not used to not being aware of everything. But he very graciously greeted them and even pretended to be a fan of Johnny's. Bob saw that he was lying so he proposed to have Johnny sign a CD for him that he graciously accepted and now had to hold in his hand because his toga had no pockets. I stepped up and told him that despite what we looked like we will do our best and our hearts are in the right place. He seemed to relax at that and told us that he will then leave, he didn't need to speak to Gloria in private anymore. He left in a flaming displ","will do our best and our hearts are in the right place. He seemed to relax at that and told us that he will then leave, he didn't need to speak to Gloria in private anymore. He left in a flaming display. \n\nOnce he left it was made clear to us that he was a deity so we all had a moment of excitement. Gloria thought we were cute about being excited about a little deity, she jumped up and started excitedly scribbling her research about making space breathable, we all nerded out together over her invention.\n\nIn Appatia there is a giant worker's union run by the oddjobers. She tells us that the best way to teach HUI was to find the rest of the pieces.  We loitered around until Gloria literally kicked us out of her office, but she gave us an ounce of weed at least. We walked out and Johnny told us we should take his car.. he had a car? A fancy Porsche to top!!..\n\nWhen arriving at the  Chimer saw a glass spider that noticed him back, was startled by each other before it twisted and disappeared.\n\nIn the distance we notice a shrouded form interacting with the same spider, they both look at us then run and start to propel themselves downwards. Chimer, Bob and HUI jumped down after her, Bob used his psychic daggers to make stairs, the shrouded figure cut the rope causing both Chimer and her to fall she catches them with a featherfall spell Chimer holding on to her for dear life. \n\nHUi and I went down in the glass elevators, we saw her use a grappling hook to pull them up a few floors, l"," to fall she catches them with a featherfall spell Chimer holding on to her for dear life. \n\nHUi and I went down in the glass elevators, we saw her use a grappling hook to pull them up a few floors, landing one floor above the others who got tossed to a lower floor due to the momentum. They run up and we run down. Hui tells security that blocks the stair holes. We arrived face to face with each other. Where was she?! Hui gave the rope to mew three who sniffed it with its non existent nostrils and pointed at the vents, still in order mode Hui looked at Bob, pointed at the vents and said fetch! Bob psychically connected to us and was on his way. He chased her until he couldn't anymore because she reached a magical barrier of some sort. Fuck! Hui reported to Gloria who sent Edna immediately.\n\nShe looked at the wall and used a magical key like the ninja did, finally letting us through the barrier. This floor was dusty and nasty, steam filled the hallways. Bob went in front, then Edna went close after telling us to keep up, and we panted after them. Bob suddenly freezes before turning a corner warning us that there was a turret. He uses his expertise to track where the ninja woman went. Bob tried to cut a cable, but it was the stability motor so the turret started to shoot wildly and uncontrollably until it fizzled out and stopped. Bob got a bullet in the shoulder but he powered on chasing the footsteps in the dust. We caught up to him and found artifacts that have the same markin","uncontrollably until it fizzled out and stopped. Bob got a bullet in the shoulder but he powered on chasing the footsteps in the dust. We caught up to him and found artifacts that have the same markings as the March keys that we had. A cloud of white smoke lands on the floor revealing two laser beams Bob guessed that there were probably more. We arrive and I try to cast dispel magic but it was too strong of a spell. Bob throws one of his knives through them, nothing happens. Johnny jumps through the lasers, nothing happens then he explodes!! He is left charred but smiling! Edna rushes us through,  we make it down the stairs arriving at a regular looking door. We walk in hitting an air-conditioned section. It was carpeted and maintained. In glass display cases there were artifacts. Edna said that there was nothing missing, musing about what the ninja was here to do if not to steal the artifact. She was worried that she might be here to mess with the machine. The room that we were in was magical and that one of the artifacts was a lever. I cast identify, the artifacts were very magical and were blinding me but in the back of the room there was a silver circlet that was a cursed item, it gives you telepathy but the voices drive you insane. So it should be one of the other four artifacts. \n\nA sword with a flawless edge\n\nA carved idol with eyes that look like pearls\n\nA Heavy tome flipping magically through it's pages \n\nA cracked crystal vile with black liquid inside of it.\n\n\n\nJohn","acts. \n\nA sword with a flawless edge\n\nA carved idol with eyes that look like pearls\n\nA Heavy tome flipping magically through it's pages \n\nA cracked crystal vile with black liquid inside of it.\n\n\n\nJohnny looked at the book and was entranced, it makes him forget a memory. He forgets the details of the raid on the Revis company. He stared more intently and learned a spell! Bob and I rip him away from the book before it does more damage. \n\nWhen distracted Chimer drinks the black liquid I try to stop him but I have no chance of reaching him. He then walked towards a wall while we watched wide eyed. He reaches out towards a door handle only he can see and opens the wall. We all watched mouth gaping as the wall opened like a door. We stepped through it and were faced with darkness. Edna says it should be bright. Chimer turns on a little orb of light when we notice a mirror projection of our party also being illuminated. Both Huis say ah fuck! I wink at myself, my reflection winks back. Johnny points his gun at his reflection. It imitates him. We spend too long being freaked out by our reflection and it took us an embarrassing amount of time to notice that it was just a regular mirror. Chimer smashes it with his staff before we move on. We reached the room with the mechanism that had a tank of fuel. It was an old fuel source glowing green. Old control panels lined the walls of this tank. One of them moves and a crane device opens up a panel and an engine device gets placed on the flo","ank of fuel. It was an old fuel source glowing green. Old control panels lined the walls of this tank. One of them moves and a crane device opens up a panel and an engine device gets placed on the floor. Chimer concludes faster than anyone that it was Albedo Edna confirms. I made a bunch of copies of fake copies of the machine, the ninja looked confused. Bob rushes her but with inhuman speed she pulls out a gun Hui sends Miew two to reflect her but she still flicks her wrist faster than him so I used my silvery barbs to superpower Miew two's fingers and he catches the bullet in mid air just as Chimer tackled her she quickly spun out of his way just as Johnny fired his gun. Bob was the first to recover; he attacked her four times, she used some sort of ability to half the damage. Edna cut her palm making a sword out of her own blood. She swings her sword, embedding her sword in the Ninja. Johnny ever swift shot her twice. Chimer grabbed his staff and embedded it with magic to attack with it, he hit her twice. I made a bad joke but she didn't like it. HUI then attacked her with MewTwo, she finally let out a loud scream. Spiders start to rush out of her clothes, Chimer screaming see I told you there were glass spiders as they rushed him, giving her the opening to stab him. We were too shocked to react as she put the tank between us. Bob runs just as fast as her makes it to her side, her eyebrows shoot up when she notices that he could keep up with her and attacks her in a flurry","oo shocked to react as she put the tank between us. Bob runs just as fast as her makes it to her side, her eyebrows shoot up when she notices that he could keep up with her and attacks her in a flurry leaving her looking almost bloodied. Edna looks around and she looks at Mewthree and gets into a strange position and asks to be tossed, Hui tells him to comply. Johnny stepped forward and lifted his guns firing again, he shot so many times so fast that it looked like steam was coming off of him. Chimer, as if using Johnny's momentum, jumped her and attacked as well. I tried to mess her up but she evaded me. Mewthree throws Edna at the Ninja as Hui stepped up and subdued the ninja. \n\nAfter a while Pailor and Gloria show up to find us sitting on the tied up ninja smoking joints and Chimer throwing up glass spiders. \n\nWe pull off the Ninja's mask revealing a young female Tabaxi. Gloria didn't seem to recognize her. She told us that she would handle it, then looked at Pailor who materialized a staff and cast a zone of truth on everyone in the room. \n\nWhy are you here? To sabotage the machine. The sun needs to rest, she said. We pressed her about who taught her about the machine that she came to sabotage and told us it was her great leader. She was part of this cult who's leader prays on people who have recently lost loved ones or want to unalive themselves. \n\nWe talk her out of her ramblings and send her to prison/rehabilitation. \n\nNote: The weed is called morning glory, so we went","n people who have recently lost loved ones or want to unalive themselves. \n\nWe talk her out of her ramblings and send her to prison/rehabilitation. \n\nNote: The weed is called morning glory, so we went down in a blaze of glory. \n\nWhile they leave Hui asks Paylor if he has heard of the cult before. Paylor tells Hui that he heard of the cult from the wilds but never took them seriously. \n\nHe gives us a bunch of badges with the emblem of the sun on them giving us the lowest clearance of authority. \n\nWe went for Pizza as we chilled in a local dominoes discussing our next move, we decided to pick up Johnny's car.\n\nWe head towards the headquarters of the banana guard. This large glass inverted dome has three circular structures with bridges connecting them. There are people in old timey knight armor all around going about their day. They were all wearing the emblem in the shape of a banana. \n\nChimer calls home, his family yells at him for not having returned home, his mom and dad didn't look anything like him, they were mixed human and elven. His father was a stern military man and his mom was warm and loving. He tells them that he is on a top secret mission to save the universe so they ease up on him, his father even salutes him.\n\nWhen Chimer got off the call a Banana guard who had joined us was politely waiting for the phone call to end. He says Welcome everyone as he clicks on a pin that makes a trumpet sound, he welcomes us to the Banana Guards asking us if we wanted a tour. Chi","ned us was politely waiting for the phone call to end. He says Welcome everyone as he clicks on a pin that makes a trumpet sound, he welcomes us to the Banana Guards asking us if we wanted a tour. Chimer took a banana that he handed him. The banana guard took us around showing us the slip and slide offices where we lost Tabaga who went down the slides. The helpful guard takes us around showing us the offices. Tabaga grabs one of the banana shaped phones and asks about bananas in pajamas. \n\nThey explained to us that they were all volunteers who believe in defensive combat and who help people. Most of them were trained therapists. The banana guard introduces herself as Tania. Johnny lifts his shirt revealing his tattoo. She called him a brother of the peel. \n\nAn old man wearing overalls over nothing, he had half a moustache as if the other half was burnt. Johnny shakes his hand warmly as they greet each other like old friends. His name was Snaggletooth, he asked Johnny if he was back to the force but Johnny told him that no he was here to pick up his car. He leads us to the back where he pulls an old tarp off an old car, significantly older than the cars around it. The old man proudly told us that the car was upgraded and that he downloaded his buddy Hank into the car. Johnny turned white when he heard the name but he didn't say anything to Snaggletooth. We all fawn over the car for a moment but Johnny asks for a private moment so we all busy ourselves while waiting for him. \n\n","d white when he heard the name but he didn't say anything to Snaggletooth. We all fawn over the car for a moment but Johnny asks for a private moment so we all busy ourselves while waiting for him. \n\nJohnny sat in the car turned on the dashboard and the letter H.A.N.K. appeared on screen, followed by a voice greeting Johnny warmly.\n\nJohnny stuttered, \"Do you know who I am?\" The voice didn't seem to recognize him outside of being the car's operator. Johnny stepped back outside and asked the mechanic what the voice was. He told him it was an AI he found on Johnny's old uniform. Johnny got back into the car and summoned Alt who appeared in the passenger seat claiming to have “eternal shotgun”. He asked her about the implications of having a Hank fragment in the car she claimed to want to take a look at this fragment. \n\nThey pop the hood and find a purposefully broken magic crystal so that it requires charging. Johnny was upset that they didn't keep the car in its classic form but thanked the mechanic gracefully and we all returned towards him. \n\nI walk into a galaxy bucks and I walk up to the latte artist with his fabulous moustache wearing suspenders on pants that already have a belt on. We argue about the price when the manager appears in a pod that violently lands in the parking lot he steps inside looks me up and finds that I am an employee of Galaxy Bucks he lets us go and tells the bartender to give us whatever we want. We take our coffees and absolutely did not release co","lot he steps inside looks me up and finds that I am an employee of Galaxy Bucks he lets us go and tells the bartender to give us whatever we want. We take our coffees and absolutely did not release cockroaches into the place and debated blowing it up! \n\nI walk up to an information rumor booth. It informs us of the activities on the planet, we decided that none of them were our thing seeing that the conventions were horrifying and crashing parties with these people wouldn't have been something we wanted to do so we decided to leave the planet, Johnny and Bob take Johnny's car engaging in a high speed drag race on the way while the rest of us took the Metro. \n\nOn one stop a group of people clambered on the train blaming one of them for forgetting to fuel the car calling the big guy Damio the two other escorts drag the third guy that forgot the fuel to kill him. As they step away three replacement escorts appear seemingly out of nowhere. \n\nHui and I split up, I jump out after the murderers who had dragged the guy into one of the public bathroom and shapeshift into their boss, I tell them I wanted to do it and send them off, the guy attacked me thinking I really was the boss, he was badly beat up by the time I got to him and his shirt was ripped revealing a fit body covered in many local gang tattoos. I turn back to myself, tell him that I’m saving him and leave him in the metro bathroom confused with his fists still up. I waited for the next car, wiping blood off my nose. In the","ocal gang tattoos. I turn back to myself, tell him that I’m saving him and leave him in the metro bathroom confused with his fists still up. I waited for the next car, wiping blood off my nose. In the metro car Hui sat across from the Damio and his entourage he kept eating his peanuts as everyone else turns their eyes away pretending that they weren't there. The Damio finally speaks up asking Hui if he was Newton. Hui tells him that he was Newton's final creation and that he had passed away. The Damio offered him a job but Hui refused, so the Damio stepped off the train at the closest station after their conversation. \n\nHui informs me so I stay on the train. I watch as the Damio and his escorts step onto my cart and I ride the train until they leave at the convention station going to watch a speaker from the wilds talk about gene splicing insects.\n\nJohnny and Bob had arrived so ahead of us that they had time to grab lunch. Hui arrived first and explained to them what we went through. As I arrived Johnny taunts me about my bleeding nose. Hui went to an information booth to learn more about the gene splicing conference. He learns the difference \n\nA 50 year old man named professor Crow with black hair and silver streaks informed us of his booth. He had a selection of what looked like taxidermy, upon closer inspection they were actually holograms. With a press of a button he can either have them behave like they would in the wild as well as dissect the creature down to the smalle","e taxidermy, upon closer inspection they were actually holograms. With a press of a button he can either have them behave like they would in the wild as well as dissect the creature down to the smallest detail to study their anatomy. We introduced ourselves to him, we walked around the convention hall with him, he made sure to make us pass in front of the smaller stands where the every man, students and amateurs displayed their wares. We saw cute little inventions like moss med kits, brooches that change colors depending on your mood, a small flower that opens its petals and lights up a small space all solar powered… while we walk around Hui rips out his eye and sends it to spy on the boss, but it gets intercepted by a young boy with a slingshot, he grabs onto it firmly Hui makes his way to the kid and they start playing tug of war with eyeball until Hui gets frustrated and clocks the kid right in the face! The inattentive mother finally gets off her frillphone and notices her child getting punched. She screams POLICE! Hui heals the kid and I calm him down, but his mother was hysterical as the cops arrive asking what is the meaning of this? I calmed the mother down while Bob Johnny and Chimer watched and laughed at us scrambling with this situation. The police wanted to fine us but Johnny interfered, telling the police that we knew Gloria, he called her to prove it. When she pulled up the footage and saw Hui clocking the child she laughed and told him to do it again. I had to","ut Johnny interfered, telling the police that we knew Gloria, he called her to prove it. When she pulled up the footage and saw Hui clocking the child she laughed and told him to do it again. I had to actively tell the police that we won't actually do it. The enforcers stepped away. Leaving us with a fine. Professor Crow politely left us after that shameful display. Ever polite he told us to sit by him if we went to the lecture. I went and paid the fine and found we also had a traffic ticket from the mime which I also paid. \n\nWe joined Professor Crow at his friend's lecture. He smiled at us politely. We sat by him ast the presentation started. A short gaunt man came on stage and started showing us his experiments on the creatures of the wilds. He shows an elephant with an armadillo shell. Someone in the audience tried to bid on the elephant, it was the mob boss that we had encountered on the metro, the Professor on stage was flustered and told him that this wasn't an auction it was a showcase. He continued showcasing his creatures. Bob points to one that he wasn’t attracting attention to so the presenter told us that it was a failed creature. But Hui and Bob didn't believe that was the whole story. He continued explaining the uses of his creations and their positive influence on the economy.. etc. He ends his presentation with a monologue about providing people with comforts to make them forget the end knocking at our door. He finishes the presentation and we get out to leave","the economy.. etc. He ends his presentation with a monologue about providing people with comforts to make them forget the end knocking at our door. He finishes the presentation and we get out to leave i bid farewell to Crow asking him again to forgive us for the scene which Hui didn't like and went off on a tirade insulting crow and the planet and everything we left Crow looking aghast as we made our way to the space port. We quickly left planet we headed towards the hero corps moon.\n\nThe Hero corps\n\nWe arrive and find a few Marks flying around in the area as we passed they stopped their training or whatever they were doing and waved at us. We happily waved back. We landed the marlin in the roofless space port made that way to accommodate the Marks. \n\nWe get off the ship and pass by sections of marks studying or working out or eating in the cafeteria, there were 20 ish Marks and a bunch of crew members that lived here to facilitate the Marks' work. We are greeted by a brownhaired woman in a labcoat, she had a clipboard and introduces herself as Mary. She told us that the Mark that invited us had passed away on a mission but she introduced us to another Mark that had the previous one's memories implanted in him. Johnny summons Alt who asks Mark if she could scan him, he tells her yes as long as it's over the belt. She doesn't find anything robotic about him other than a monitoring ship in his brain. Tapping him on the shoulder telling us that he is 100% biological. How they ma","yes as long as it's over the belt. She doesn't find anything robotic about him other than a monitoring ship in his brain. Tapping him on the shoulder telling us that he is 100% biological. How they make Marks was a mystery, making clones is illegal Mark was the exception so the process was a closely guarded secret. We greet Mark and give him our condolences for his death. He leads us to a big machine that can scan your being, they use it after missions, he thinks it could help Chimer identify what he was. We put him in the machine that starts to spin around him in a mechanical whirling. Once the machine made a ting sound indicating the end of the scan the Mark and some of the scientists went to see the results. Mark looks up from the results and asks him what race he was but Chimer couldn't answer he didn't know, Mark tells him that his blood type was strange, as if it was all of them at once. Some of his proteins weren't as developed as others as if he had an ancestral gene that relates to everyone in the world. Mark asks him how old he was. Chimer told him that he was 25. Mark tells him the machine says 2500 years old! Bob disguised as a human takes a turn in the machine which leads the scientists to assume that the machine is broken because Bob looks like he has no bones. They took blood from Chimer and told us that they would fix the machine. We took Johnny's car to joy ride around while we were here, we barely avoid hitting a golf car as Johnny swerves to avoid it still "," took blood from Chimer and told us that they would fix the machine. We took Johnny's car to joy ride around while we were here, we barely avoid hitting a golf car as Johnny swerves to avoid it still zooming we pass a lady and her skirt lifted from the speed we arrive at a place where two men were carrying a glass plane I stand up and fling a copy of the lucky Lincoln at the pane of glass shattering it. Hui tried to mend it as we passed but he missed, we quickly get stopped by a mark Hui went to fix the pane of glass as we apologized to the Mark he told us that seeing that most people drive golf carts they don't technically have a speed limit but that we needed to slow down we apologized and fixed the pane of glass and bought the workers a couple of apology hotdogs. \n\nFinally back at the Marlin Johnny gets news from all over the solar system the most striking was news from Cupie, ever since the worker revolt on Apatia and the fall of Aphrodite on Cupie many jobs had opened up so many people moved from Apatia to Cupie.\n\nWe decided to go to Sulfur. Sulfur is a tidally locked planet that is very close to the sun, the side exposed to the sun is inhabitable but the shaded side had the city of brass, an agraba looking place but on fire!\n\nOn our way we encountered two ships parked next to each other while the crews of both ships flew between the ships trying to board each other. We receive a morse code type signal, it's a cipher telling the ship to give privacy causing the autopilot","to each other while the crews of both ships flew between the ships trying to board each other. We receive a morse code type signal, it's a cipher telling the ship to give privacy causing the autopilot to shift trajectory to go around the fight. We watched the fight as we passed around them watching how they had interlocked platforms where the two crews fought it out. Hui checked on the ship and found that the temperature had risen and that all its sensors were pointed away. Johnny summoned Alt who pointed out that we could talk to the Marlin's AI so we asked why it's looking away. It informs us that it's rude to stare, making us conclude that the ships were in love! The Marlin confirms our suspicions and tells us that the ships had been waiting long for the crews to bring them together. We watched as these evenly matched pirates took each other out. We went in after the last two had defeated each other, Bob took pictures of their faces and collected the bounties on them. We searched the ships and the crew for items of value. Hui finds a robotic arm, a multitool, Johnny finds a lens, I find a few gold pieces, Chimer found some jumping bracers and Bob found a magical tattoo machine that turns magical items. We unceremoniously throw the bodies into space and program the ships to follow the Marlin. Taking off with the ships in tow. On our way Chimer looked into the key fragments that came from the Marches, and found that he had the fragments of two different keys that open up the","low the Marlin. Taking off with the ships in tow. On our way Chimer looked into the key fragments that came from the Marches, and found that he had the fragments of two different keys that open up the vaults.\n\n\n\nSulfur\n\nI spoke to the two ships and as the Marlin said they were in a relationship, they were in a relationship when they were alive. They ran into each other at the dealership from where they were stolen and when the pirates became enemies the ships would incite them to fight just to meet each other. As I sit in the crownest of one of the ships talking to them I see the bright glowing planet that is Sulfur circling around the back. We see the glimmer of gold, the city of brass covers the whole dark side of the planet. The closer we got we could see the beautiful sandy place so blasted by the heat that it turned into glass, mountains of glass and sand framed the city of Brass. \n\nWe placed our ship in storage at the space port. We were given blue gems 💎 said to protect our skin from the intense heat we put them against our skin and they worked, we were able to walk out into the bustling scorching city. We explore a little until we end up in the food district suddenly the crowd parts and a convoy flanked with two blue genies surrounding a pure blooded fire genie leaving scorch mark footsteps. People took out their frill phones and took pictures of him, Lord Erixus one of the two brass lords. The two people in charge of the whole planet. It was a monarchy split into tw","corch mark footsteps. People took out their frill phones and took pictures of him, Lord Erixus one of the two brass lords. The two people in charge of the whole planet. It was a monarchy split into two: the traditionalist and the creator. This planet is known for its mineral refinery. But they also export spices, the food didn't look appealing but it was very tasty, they had a rich culinary history. We decided to try to stumble upon the lord\n\nWe went deeper and deeper into the bazar until it became too tight that the stores became two stories high with flying creatures being attended to on the second floors of the shops. A little deeper we found Four pillars holding up the tower and a crowd at the bottom because there are two teams playing soccer. It was an intense game, the ball was on fire, it was devils vs ifriti leaving trails of fire on the ground as they ran across the sand field that they had made to play on. One of the stores seemed to be protruding forward more than the rest, we snuck in behind it and found more stores like ones that sell elemental engines like the one on our ship we also find a few stores that sell spirits Chimer walked into one of them and watched people buy things a cloaked man bought a small gem for a car sized engine keeping his face covered the whole time. The shopkeep calls a young woman, his daughter, who came in to translate for Chimer. She takes him to the back and shows him their selection of elemental gems. He asks if she has anything jui","le time. The shopkeep calls a young woman, his daughter, who came in to translate for Chimer. She takes him to the back and shows him their selection of elemental gems. He asks if she has anything juicier so she opens a secret compartment in the case and shows us more gems. Chimer pushes her, telling her she knew what he truly wanted. She locks her shop door, flips the sign from open to closed and leads us in the back. She shows us elemental engines with a green swirl in them, saying that they had the empathetic gene removed so they would fight other ships if used. Johnny asks for spirits and she tells us she also sells them. The young lady who was called Ruba apparently was a fan of Johnny's asked him for an autograph. We made sure that there were no fey contracts on the worn record she gave him. He signed it happily. We ask her and her father if they were willing to lend us Ruba for the day to translate for us around the market. He agrees for one gold, we give him one and her two. She places the money in her father's hand as she excitedly goes to get ready grabbing her rocker boots as her father yells about it she kisses him on the forehead and we go off. I asked her about the strangeness of the presence of the lord in the back market or the plume. We ask her about the lord being in the market. She says it's weird that he is here, because he would burn this place to the ground but the other leader knows of this place. She was going to say something more but stopped herself.","ng in the market. She says it's weird that he is here, because he would burn this place to the ground but the other leader knows of this place. She was going to say something more but stopped herself. \n\nRuba grabs us and moves us to the edge as the lord passes between us with his escort of fire genasi ifriti and genies all in black suits he leaves some of his men behind where the other genie had left his men. He was a big bulky fire genie himself in a high quality black suit. He headed into a pizza joint. We decided to go eat there ourselves. There was a slight gap on our way to the restaurant. Alt appeared on the other side and switched with Johnny. Hui had Mew two toss him, I misty stepped elegantly. Chimer started a run but stumbled and fell through the hole prompting one of the mafia detail men to fly down and catch him. as he berated him about Doing something dumb but as Chimer stands up and attempts again this time he elegantly does a back flip and clears the gap like a pro gymnast causing an uproar of cheers from the security detail and the mafia detail. We step into the pizza place, the shops on the platforms don't expect tourists so they don't speak common so Ruba had to order for us. \n\nWe ask Ruba about the landmarks she says the mines that have been turned into an amphitheater and the crater which isn't a crater but the Lady Vera is a fair ruler to the devils; she makes sure everything benefits the devils and the Genacy equally. The elementals don't mind having the","itheater and the crater which isn't a crater but the Lady Vera is a fair ruler to the devils; she makes sure everything benefits the devils and the Genacy equally. The elementals don't mind having their dead being used to power engines. They were made to burn. The planet has been mined to a point where the sky turned black from the smoke of the factories. While we eat one of the goons steps out of the back and into the bathroom. Hui uses the opportunity of him returning to the back to slip his familiar eye into the back with him. The man he followed was a sharp man in the mafia suit . There are pizza boxes on the floor and a royal guard waiting in that space playing solitaire. Hui hears two people arguing with a third person in the next room. Two adults talking to a teen all three were men. They spoke in primordial, so Hui repeated what they said for Ruba to translate for us. They argued with the kid. People finds the kid somewhere unsafe. They found him lying in the street and berated him for it. He apologized. The mafia guard turned on the radio, drowning out the rest of that conversation. We tell the pizza shop that we are problem solvers. He informs the people inside and the mob goon comes out to get us. We show him our fake credentials and he takes us to the back where we stood face to face with the don, one of the great heads of the criminal organizations,  they are a security racket and they smuggle contraband. They specialize in transportation. The lord Erixus in his ","ood face to face with the don, one of the great heads of the criminal organizations,  they are a security racket and they smuggle contraband. They specialize in transportation. The lord Erixus in his fiery glory sat in the corner looking away from us. The don introduces himself as Mikey. The guard comes to stand with us in the room but was waved off by the Don. I introduce us but the Don says he knows most of us, Johnny and Tabaga from their fame, me from my website where the only fraudulent information was my hight, he knew that Hui was peaking the interest of the  foundation. He also says that he knew Chimer's father from the army, he tosses him a coin dating since before the devils and tells him to say hello to his father from him. He then turns to Bob, and says I have no idea what the hell you are, don't make a mess on the carpet. He introduces the young man as Hasan he says he indulges in the fey spirits because if you keep them on for too long it gives you a high. The Don says that he doesn't like the spirits because this is his home he doesn't want it being ruined by drugs. We tell the Don about the fabricator being used to make the spirits and so we have a goal in common. They refused our help and said that it was their home and their business. Erixus’ son offered to go with us so his father, enraged, refused he cast dominate person on me and stood up to leave. Chimer stood in his way so he ordered me to try to push him. I wasn't strong enough. Johnny and the Don both","ith us so his father, enraged, refused he cast dominate person on me and stood up to leave. Chimer stood in his way so he ordered me to try to push him. I wasn't strong enough. Johnny and the Don both reached for weapons so Chimer stepped aside. Erixus stepped out and dropped his spell on me. \n\nWe stayed behind arguing with the Don and Hasan talking about payment and we asked for the Fabricator so he asked us for the lead. We told him that he had to take us with him. We agreed to send only Hui. We step outside to find Ruba talking with the mobster goon apparently his name is Harry. The Don scolded him for having left his post and hinted to Ruba that she shouldn't take over her Dad's business. We take Ruba back to her dad's shop ourselves she was avoiding our eyes as we walked to the car so we asked her what was wrong she had mixed feelings about what the Don had said. She says that her dad has been doing this to put her through college. She was studying political science. She wanted to work towards abolishing the monarchies l, even if they were two it's still a monarchy. And they were turning a blind eye to many things!. Miners were dying because the work was going so fast, that's why there was such a big influx of workers to the planet. Hasan arrived and behaved awkwardly around Ruba and wanted to leave quickly. We told him to listen to what Ruba had to say as the future leader of the planet. He mumbled about not wanting to rule before leaving our side awkwardly. We dropped "," Ruba and wanted to leave quickly. We told him to listen to what Ruba had to say as the future leader of the planet. He mumbled about not wanting to rule before leaving our side awkwardly. We dropped off Ruba in a limousine cat and drive off going deeper towards the black clouds we arrive at the industrial district and drop off Hui and Miew two and then we take off towards the center of town where we arrive at two spires a square one and one with frills to make it look like a whirling flame. We stopped at the flame one Hasan ran ahead of us we made it to the penthouse. It was a mess but if it wasn't it would have been pretty nice, the windows if not caked with a layer of dirt it would show the beautiful sun blasting the planet turning the sands into glass. We ordered room service and played Mario party. \n\nHui in the limousine with Harry and Mew Two get stopped to the side Harry told the officer that he was a miner and that Hui and Mew Two are mine inspecting machines the guard doesn't buy it so Harry bribes him with some of the elemental stones with green swirls in them. He lets them through so they continue to the mine. They enter the mine named the crater. The very sand was gems. The walls and ceilings are packed with super valuable gemstones. The mine was off limits to the majority of the solar system. The whole planet looked like these mines but they had mined the whole planet. The stones held the souls of their ancestors. Hui found it weird that they would mine their anc","ority of the solar system. The whole planet looked like these mines but they had mined the whole planet. The stones held the souls of their ancestors. Hui found it weird that they would mine their ancestors to use them as engines. Harry told him that it was a difference in culture to them being helpful even after death.  \n\nHarry explained that to make it to the burning side of the planet they had to go through the crater to the other side. They made their way down as far as they could in the car as the road became steeper and steeper until they reached a giant vertical hole with elevators. It went through the whole planet! They had a gaping hole in this planet. They made their way into the elevators they squeezed into one with some miners. The elevator went down until the elevator started rotating and started going sideways. The hole had artificial gravity that made it a tunnel instead of a hole. Miners pushed carts with gems along the sides. They make their way all the way through. They reach a crowd of people that had assembled around a woman clutching the Don's cloak crying in primordial the don picks her up and says something to her she thanks him and kisses one of the employees on the lips and they run off together. Hui asked the Don what that was about and he told him not to worry about it, just an employee and his wife who want to open their own enterprise. The Don briefs Hui about the operation having gotten permission from his brother Erixus so the royal guard wasn't","o worry about it, just an employee and his wife who want to open their own enterprise. The Don briefs Hui about the operation having gotten permission from his brother Erixus so the royal guard wasn't going to interfere in their actions. They made their way past the core and closer to the other side of the planet, the hot part.. But they started running into trees. The guards and the miners looked around confused. There shouldn't be any trees on Sulfur; it was too hot. The roots became so thick that they had to step out of the cats and continue on foot. Hui and the miners whispered a song as they walked. Because the mod guards wouldn't let them talk any louder. Suddenly they heard something rustling in the bushes and a cute bunny jumped out of the bushes they all fired frightened at the bunny emptying their magazines and missing it completely as everyone reloaded Hui sighed. As they advanced more they started hearing birds in the trees. Suddenly they turned around and two of them were missing. Hui inspects the area and notices a vine growing up the guards leg; he shoots it off as it makes a cry of pain. The deeper they got they started hearing the sound of music. Hui instructs the fire elementals to burn down the forest. They stood in a row and tried to burn down the trees but these trees seemed fire proof. When the fire died down they noticed that the music had stopped Hui suggested to go back for his team. The guards started retreating one by one until even Hui was running ","ese trees seemed fire proof. When the fire died down they noticed that the music had stopped Hui suggested to go back for his team. The guards started retreating one by one until even Hui was running back. He caught a glimpse of humanoid figures wearing masks. Hui and Harry made it back out only one goon and both the miners remained. Hui berated Harry at being incompetent and called the Don. Hui told the Don about the shameless display and demanded the rest of his team. He told the Don everything who asked to talk to Harry and Hui heard yelling in primordial, then settled down and had a regular conversation. Harry told him that he will take him back to the penthouse Hui called him a massive disappointment, and went with him reluctantly. \n\nMeanwhile we played Mario party with Hasan. Hasan offered us some old pizza that was lying around. Hasan talks Chimer into escaping from the window. I try to stop him but he did a sick backflip and landed on a lower floor. Hasan and him decided to go partying together so Hasan picked him up and flew off. Harry and Hui burst in just as they started flying away Harry quickly asked about the kid so we all pointed out the window at them getting further and further away.\n\nChimer and Hassan arrive at a bar. Hassan greets the bartender , Andrey familiarly introducing Chimer as his buddy. They order drinks and Chimer asks him how he feels about Sulfur. They took some Doudou shots They bonded over having similar family pressures to do things. Chimer ","rly introducing Chimer as his buddy. They order drinks and Chimer asks him how he feels about Sulfur. They took some Doudou shots They bonded over having similar family pressures to do things. Chimer regaled him with tales of our adventures showing him the lucky Lincoln telling him that it's a perfect copy. Hasan tells him that his uncle is the one that buys the second most slaves and releases them on Appatia. The Shimana clan are the ones that buy the most. Chimer convinces Hasan to show him what he does with the spirits. Chimer looked around and saw two tables of interest one with gangsters and one with a group of outsiders people that the gangsters were harrassing. Hasan approached the gangsters who greeted him like they've done this a hundred times. They exchanged something in secret and he left after having bought them a round. They threw a crumpled piece of paper at the table of outsiders who picked it up and read it. Hasan takes Chimer to “his favorite place” , an untouched garden. He pulls out what the gangsters had given him; it was a bag of tiny tiny gems. He turns it on and a bunch of silhouettes of spirits pop out and go to run around in his garden. Chimer pointed out that he and his uncle were similar in freeing the trapped spirits and slaves, which seemed to have resonated with Hasan. \n\nMeanwhile Harry and Hui tell us what they saw while we bombard Chimer with messages of just the word Penis. He sees the messages and both he and Hasan hurry back understanding th","sonated with Hasan. \n\nMeanwhile Harry and Hui tell us what they saw while we bombard Chimer with messages of just the word Penis. He sees the messages and both he and Hasan hurry back understanding the urgency of the situation. We met them halfway and took Hasan back to the tower to his penthouse. We receive a screaming phone call from the Don about having allowed him to run off Chimer tells him that we needed to attend the situation and that he needed to have a heart to heart with his nefew. We waited until Tom arrived to watch Hasan and we made our way to \n\nWe take the elevators down into the crater led by Hui who had already made the trip. We easily maneuver to the section of the tunnel with roots and grass. Hui said there were more bugs than before. In the distance we hear the music. Hui deduces that the music is magical. A strange form of incantation, so there was a source somewhere. He used a detect magic ritual as the bugs playfully watched us I sat on a root waiting for him, Hui's senses were pummeled with a great strong magic. The music was casting the magic he sensed it's source deeper in. We venture deeper into the tunnel the air got cooler as we walked through the roots. We arrive to a clearing the floor was made of glass as a person in ice skates wearing a beautiful gown flowing behind them and a copper mask depicting an animal. As we were debating walking around them Johnny yelled back to them which startled them causing them to fall and break their ankle. It cr","gown flowing behind them and a copper mask depicting an animal. As we were debating walking around them Johnny yelled back to them which startled them causing them to fall and break their ankle. It crawled backwards on the glass and \n\nThe creature I cast message but they didn't speak common I healed him holding my hands up and he softened. He stood up bowed and reeled. He did a beautiful performance for us reeling up for a finale he does a beautiful flip opens up his wooden body revealing flowers and beautiful petals landing perfectly. We applaud him. He does a little bow proud of himself. We leave amicably waving goodbye.\n\nThere was a red pool where the plants had borrowed the glowing red from the pool. A sign in silvan had the words Red root grove on it. The sign was made of normal wood and was being seared to a crisp where the red thorny plants came in contact with it. Johnny summoned Alt who kicked the tree root damaging it and saw that a searing hot liquid came out of it. Suddenly we hear galloping so we retreat back from the red section leaving just Alt. After a moment a wooden horse arrives his mane made of viscous Lava being ridden by a big robed man covered except for a thin arm holding a lance. He was a larger Briarling than the skater. Bob and Johnny point out that it's strange that they are growing plants on their bodies and deduce that they must be serving an archlitch. He tells us to come out of hiding and tells us that we are welcome to attend the masquerade bu","s strange that they are growing plants on their bodies and deduce that they must be serving an archlitch. He tells us to come out of hiding and tells us that we are welcome to attend the masquerade but to not hurt the trees and nature. He tells us that we are not allowed in the fey wild but we may proceed.. the fey wild! What. He explained that the rulers are the two grass lords, lord Briar whom he serves and lady kelly who was the night court leader. He told us not to bother them. We thank him and continue forward. After a while we find a big stage with a dozen figures with wax dripped on them for ages with little wicks. I jump up on stage and start playing the flute. Two of the figures have a flame appear on top of their heads and they dance together. The rest of the party sat around appreciating the moment when I was done playing. The wax figures had melted to puddles that went to take their previous position in line and reformed into the person-shaped figures I bow and we move on. After a while the trees get thinner and thinner, being strangled by some very tall grass. Hui on top of Mew three could see over the grass to where the grass was dominant, he noticed that there was less insects in that area. Bob's trained ears picked up the sound of a crossbow in the distance he signals us all to duck but Hui doesn't get off of Mew two. The bolt came in blocked expertly by Mew two. Then silence. we looked around frantically. Chimer pointed to the north east. I cast message told ","nals us all to duck but Hui doesn't get off of Mew two. The bolt came in blocked expertly by Mew two. Then silence. we looked around frantically. Chimer pointed to the north east. I cast message told them that we were allowed to be here. He shot at us again. Johnny uses Alt to locate him exactly. She leads them towards him while I cast the message spell over and over again to distract them as Johnny and Bob get close to him in the tall grass, the rest following them but a little more disoriented by the tall grass. Johnny reached him first and fired his gun. Bob close behind turned into a giant slime shuriken that let the grass slip through him but he made heavy contact with our attacker. He runs using misty steps after being shot by Bob Hui tried to throw his eye to find him but he was ready for it and shot it out of the air. They scrambled to find him. Bob psychically linked to Johnny as I gave them inspiration. A bolt hit chimer, I tried to shoot a vicious mockery in his direction but I missed Johnny being pointed by Bob pulls out his guns and shoots and shoots and shoots until the cloaked figure fell revealing it's an elven person wearing moon crested armor. An assassin from the winter court. \n\nAs we stood over the body we hear a voice announcing: “excuse me may I have everyone's attention” we turn around and come face to face with a scarecrow in a beautiful green cloak with a little speaker attached to it. Chimer and Bob told it that they will give their attention. It ask","e's attention” we turn around and come face to face with a scarecrow in a beautiful green cloak with a little speaker attached to it. Chimer and Bob told it that they will give their attention. It asks for our names. We give it fake names and he realized that we had caught on. It asks us if it can pay us to leave. We refuse The creature casts spells on us chimer almost walked off but Hui caught him. He even cast a spell on me that limits me to 6 letter words or take damage. I try to articulate that we are here to help him save the fey wild he lets us through showing us a path. As we walked I tried to articulate that we shouldn't trust him as Johnny screams that we had fallen into a trap as we look down at our feet and see a magical glyph. They all jumped out of the way as Mew three shoved me out of the way and he got affected but the effect vanished with the glyph. Whatever it was had no effect on him. I hug both of them and thank them. I steal the green cloak off the scarecrow. I make a shabby little makeshift shelter that looks way bigger on the inside than it does on the outside. We all pile in and take a long rest. There is a young elven looking boy with a box of chocolate in his hands with flowers on it he opens the box and a big green cloak comes out and wraps him up making him grow exponentially We all have the same dream he lays the box in front of us and in the box there are three ducks, they fly out of the box and separate us with darkness. We hear a familiar voice "," him grow exponentially We all have the same dream he lays the box in front of us and in the box there are three ducks, they fly out of the box and separate us with darkness. We hear a familiar voice the traveler speaks up and says that our bodies might be safe because of my amazing hut but he can get to our dreams and puts up a game where if everyone eats the duck we get 50 gold if no one eats the duck we lose 50 gold \n\nTabaga ate a duck as the traveler continued explaining that if only one person ate the ducks or one person didn't eat the duck they would gain two levels while the rest get nothing. If the majority didn't eat the non eaters get one level. If the majority did eat they would get the level. In the dark trusting each other. Hui couldn't eat so I was going to also not eat so that the others could take a level. We awoke to find that johnny and bob had lied and also not eaten, causing Chimer and Tabaga to be the only ones not to gain a level. I was very upset as we moved on. Before us the lava brambles, dropping searing leaves on us. Bob and Johnny ran through without thinking twice, landing in a safe clearing halfway through. Johnny had given Hui and I straw umbrellas that he had made that could fit four people. There were five of us. Tabaga rushed across and caught two leaves but Hui next to her under his umbrella with Mewtwo cast cure wounds on her. Johnny summoning Alt on the other end he switches with her. Bob rushes the rest of the way expertly dodging the lea","o leaves but Hui next to her under his umbrella with Mewtwo cast cure wounds on her. Johnny summoning Alt on the other end he switches with her. Bob rushes the rest of the way expertly dodging the leaves. The ones of us under the umbrellas make it through comfortably. Tabaga also ran under the leaves something moved in the bushes causing a bunch of leaves to head straight towards Tabaga Johnny tried to shoot the leaves out of the sky as Mewthree jumped shielding Tabaga with his big body taking all the damage. He then escorts her the rest of the way. As we stood over Hui mending Mewthree while I asked them why did they run \n\nWe hear a voice and we turn to see a woman in a hoodie and knee high socks doing her nails with two displacer beasts around her. She introduced them as fluffy and munchkin and she introduced herself as one of the grass lords, Kelly. We have a philosophical debate about the futility of trying to maintain the traditions of the feywild like the masquerade ball \n\nHui tells us that these were the same creatures that had attacked his previous party. As he casts a snare trap between us and the beasts. One of them falls for it as the other one rushes us. Bob and Johnny shoot and attack them but these things were tough so I cast Phantasmal force on the closest one convincing him that the other one was his target he turned to face the other beast while we made a run for it. We continued down the path and suddenly felt that the stones that were defending us from the ","incing him that the other one was his target he turned to face the other beast while we made a run for it. We continued down the path and suddenly felt that the stones that were defending us from the heat were drawing in too much cold. We took them off and realized it was cold. I gave them an inspirational speech as we made our way deeper. We hear a scream and a growl from the opposite direction of our path. Tabaga took off towards the noise Johnny ran after her Chimer ran forward. I ran off to the side. Hui and Bob stayed put looking in our three directions confused.\n\nI found a mermaid with her tail frozen in the stream I knelt to help her and her torso opened up into a mouth trying to attack me\n\nChimer continues forward and sees an old lady walking leaving the flowers frozen in her trail. He tries to walk past her just as she has completed a circle while cackling..\n\nTabaga arrived at the source of the sound and found a man tangled in some branches she ran to help him but Johnny jumped up to stop her telling her that it's obviously a trap. But she doesn't listen and frees the man from the vines. She saved the man but the displacer beast starts circling them. \n\nWaiting in place for everyone to return. Hui and Bob saw Chimer come back holding a decapitated head of a hag when he arrived his eyes rolled and started glowing green. \n\nHe cast a spell taking Bob out immediately and then ran up to Mewtwo and headbutted it ferociously, he was obviously not in his right mind!.\n\nThe dis","rived his eyes rolled and started glowing green. \n\nHe cast a spell taking Bob out immediately and then ran up to Mewtwo and headbutted it ferociously, he was obviously not in his right mind!.\n\nThe displacer beast attacks Tabaga wounding her gravely. Johnny that was right behind her attacks it with his guns juggling it. \n\nThe mimic lunges at me but I manage to evade as I hurled a barrage of rocks at it allowing me to step away from the thing.\n\nTabaga gets up and attacks the displacer beast.\n\nBob unconscious starts flashing back to the first time he gained true consciousness. He sees small children running around vents and playing with pets. People having families.  He was on a large large ship that was carrying families. Bob was following a specific family, a mother a father and his brother and two young kids. This felt like a generational ship, they didn't go out too much, they homeschooled their kids so Bob learnt with them. One day the mother asks the young girl to get her something from the fridge…\n\nHui put his hand on Bob and brought him back.\n\nMewthree attacked Chimer, he raises his arm a blade comes up and he swiped at Chimer a glowing \n\nChimer pummeled Mewthree then turned his attention to Bob and attacked him so Bob deflected him but Chimer swung back at incredible speed and attacked Bob again, this time he couldn't evade it.\n\nThe displacer beast lashed out but Alt and Johnny were too dexterous for it.\n\nJohnny fired back at it twice, hitting it once as it warped in an","and attacked Bob again, this time he couldn't evade it.\n\nThe displacer beast lashed out but Alt and Johnny were too dexterous for it.\n\nJohnny fired back at it twice, hitting it once as it warped in and out of existence. But it was enough Johnny took it out. He had sent alt towards us, he looks at Tabaga and tells her to help the miner as he switches with Alt and arrives in front of Chimer and snaps him out of his trance then points his gun at the mimic and shoots it full of holes. Pushing it back 40 feet. I thank Johnny while catching my breath I turn around and cast a little spell on the mimic but it was unaffected. \n\nBob noticed that Chimer hadn't snapped out of it and hurled a bunch of attacks at him that hurt him a little but Chimer maintained his concentration\n\nHui cured wounds on Bob who was looking finally better.\n\nBut Chimer shot a witchbolt at him and bloodied him all over again. Chimer heals himself. \n\nSo Johnny attacks him, damaging his strength. He grappled him and then cured Bob's wounds somehow! Golden beautiful golden light comes out of him with a very different esthetic from his warlock magic! He shook Chimer screaming at him. But Chimer doesn't snap out of it.\n\nI see the Mimic get closer as I hysterically scream at him to snap out of it and I backhand him in the face knocking the green out of his eyes. Finally! I scream about the mimic hiding behind them.\n\nBob gets up from death for the third time and boils with anger he throws his psychic dagger flying throu","face knocking the green out of his eyes. Finally! I scream about the mimic hiding behind them.\n\nBob gets up from death for the third time and boils with anger he throws his psychic dagger flying through hitting the mimic true this thing collapsed as it continued running.\n\nBob, Hui and Johnny took turns kicking chimer in the balls as we gathered ourselves.\n\nWe join Tabaga and the miner taking a small rest as Hui was rebuilding Mewthree into Mewfour. We asked the Miner how he got there, he told us that he was working close to the feywild and was magically moved inwards. We noticed that we were in fact deeper than we thought we were somehow magically being pushed along, the exit of the tunnels was in reach because of it. \n\nThe miner asks to tag along with us, he is a genasi,  a fire elemental half ifriti half humanoid. He seemed genuine. \n\nAs we discussed among ourselves if we were going to take him with us, the man went off looking for an owl bear that was supposedly helping him when he was captive. He finds her hiding in the bushes, she grabs him by the arm and walks us towards a bush gesturing for us to join them. In the bush we could see in a clearing up ahead unaware of us there was a beautiful stag with horns like a minora with candles on each of its horns dripping candle wax. He walks on to the clearing and kicks up the dirt revealing the floor being an orange clear glass. The owlbear crouches like it was about to pounce. Suddenly an arrow hits next to the stag who takes "," He walks on to the clearing and kicks up the dirt revealing the floor being an orange clear glass. The owlbear crouches like it was about to pounce. Suddenly an arrow hits next to the stag who takes off followed by two figures in brass cloaks. We give the miner and his owl bear friend food to keep them sustained after all this time not eating, we find out that this owlbear had a fey spirit embedded in it to bring the extinct creature back to life. Chimer showed it the memory of Hasan freeing the fey creatures it looked at him with a longing. We decide to go kick the Travelers ass. We move forward with our two new companions.\n\nThe deeper we went the colder it got. We reached a large plane of emptiness. If we kicked the snow on the floor it revealed the same deep red glass. Hui makes us torches for each of us to wear on our backs. Johnny pulls out his guitar and I accompany him with my flute as we played music and Hui sang singing that we hated the feywild. We find old endangered and extinct creatures frozen in the amber. We reach a big hedge spanning the width and height of the tunnel. Strange thing to find in the middle of snow it being a spring time bush! The cold winds seemed to be coming from it. Hui pushes slightly though and says he sees a light at the other side. Johnny sends Alt to check it out she tells us that the coast is clear we step through one by one and are hit with warm weather! Beautiful trees and people and critters. Up in the sky the sun very close engulfe","nds Alt to check it out she tells us that the coast is clear we step through one by one and are hit with warm weather! Beautiful trees and people and critters. Up in the sky the sun very close engulfed most of the sky but it wasn't hot! And it didn't burn our eyes. We had exited the tunnel! There we were greeted by a centaur with a copper mask on and he says: \"Thank you for making it! You're just in time for the masquerade. “\n\nWe find ourselves in a festival with free alcohol. Chimer was already downing a drink before we were able to see anything else. Johnny also downs a drink, Chimer held it together much better than Johnny did, the alcohol was apparently very strong. \n\nA man nine feet tall made of wood with a crown of flowers growing out of his head walked out of a big tree . He introduced himself as lord Briar and we applauded him as he announced the beginning of the masquerade of Sulfur. He said to preserve the traditions as people applauded the lord's speech. During the welcome speech I feel a tug at my coat. I look down and see a young Goblin with a clipboard asking for our names. I tell him John 1 through 6 and that the miner John 7 and the owlbear Jack would not be joining us. He notes down that we were aware of basic tricks and then our fake names. We gathered around the lord Briar as he announced that the celebration to honor the Traveler and that the best champion of the fey will be recycled and given to the traveler so that he would be recycled. Hui and Johnny ex","e lord Briar as he announced that the celebration to honor the Traveler and that the best champion of the fey will be recycled and given to the traveler so that he would be recycled. Hui and Johnny expressed that they didn't want to do so, Hui being a robot. And Johnny having apparently acquired his body at the sacrifice of his dear friend. Chimer misunderstood and claimed that he didn't want to die, the crowd was booing us at this time! I spoke up and told my fellow Johns that we should not insult our gracious hosts and that I would be honored to be recycled and told them that they could in fact recycle these nuts, everyone took damage except my party.\n\nHui sussed out that the tree that the briar lord walked out of was a tree portal made by lord briar, not the tree itself. Lord Briar explained that we are competing for an audience with the Traveler and that this is an honor \n\nI approached the lord Briar and charmed him and told him to find me after the celebration.\n\nA goblin banged his gavel prompting lord Briar to move on with his speech announcing the beginning of the tea party of truth. Meanwhile Johnny downed another drink and started slurring his speech. \n\nWe sat around a giant pot of tea Chimer grabbed the big pot and drank the whole thing. Johnny berated him with slurring words. A big tray with three blocks of cheese. Chimer picks up one of them and they start screaming. I smack him with a bagel stopping him from eating it. The lord Briar explained that the three chee"," words. A big tray with three blocks of cheese. Chimer picks up one of them and they start screaming. I smack him with a bagel stopping him from eating it. The lord Briar explained that the three cheeses will answer questions and we need to find which cheese is most honest. \n\nCheddar Mozzarella and Rockford.\n\nChimer asked the Rockford if it was cheese so the Rockford answered that anyone can be cheese. Then it was the cheese's turn to ask Chimer a question. He asks do you think your father will ever abandon you. Chimer said I don't know he isn't my real father. Which bummed everyone out but was accepted by the cheese as truth. Johnny grabbed a Cheddar and asked what is a Rockford? Which it answered it doesn't know any Rockford and then asked him who in the party do you like the least? He says it's himself. Which bummed everyone out even more the cheese accepted that as truth then Johnny downed a third drink getting extra destroyed so the waiters cut him off I tip the waiter who tipped his hat at me. I pick up the mozzarella and ask it if I was to ask the other two cheeses which one was the honest cheese what would they say? It answers that it doesn't know,  it's just cheese. The cheese asks me if anyone will ever really know me. I tell it no, I work hard for it to be that way. Which bummed everyone out again. It called me sad and moved on accepting my truth. Chimer also tried to question the mozzarella about the two cheeses next to it and it answered that no it was just chees","ich bummed everyone out again. It called me sad and moved on accepting my truth. Chimer also tried to question the mozzarella about the two cheeses next to it and it answered that no it was just cheese. Then it asked if he would ever find his place in the universe he told it that no he was the last of his kind. Which bummed everyone out again. The cheese accepted his truth and the Johnny asked another cheese if it was cheese it said yes and asked Johnny Do you think you're better off in a corporation Johnny said hell no which the cheese accepted. One of the people competing with us, a fairy, spoke up and claimed that the mozzarella was the most honest of cheeses and the lord Briar gave them the win. Hui was going to cry. The world is in danger and we are talking to cheese, he lamented!\n\nWe walk through the barrier one by one and go sit in a circle. We had to face each other with compliments. Chimer flirted with the Fairy and they ended up bonding but he won. Johnny steps up and through slurred speech and gagging he compliments Chimer, Chimer retorts with: You are the sound a broken world makes when it remembers it has a heartbeat. Winning that round. I was faced with him next but something came over me and I kept insisting that we forget all about this and just go drinking. So he won, then the skater stepped up and by default won because Chimer put his foot in his mouth by forgetting to compliment him. \n\nThe next round was the Fashion show. We were taken to a space with chest"," won, then the skater stepped up and by default won because Chimer put his foot in his mouth by forgetting to compliment him. \n\nThe next round was the Fashion show. We were taken to a space with chests of clothes. We have to impress two goblin Judges. \n\nThe owl court was taking notes of our every action. Chimer dressed up in extravagant furs and shells. I jumped into a chest and screamed I'm a mimic! The Goblins said I needed more shit and so Johnny… helped.. The fairy makes stilts out of the ossified bones of some long dead creature. The skater covers himself with twigs but the goblins were unsatisfied with it so it went to my chest and scooped out some poop and Johnny pukes on him so the crowd applauds it apparently adding a lot to the skaters costume. The Goblins were finally satisfied with our costumes and we are then told about the next phase of the challenge. The lord briar announced that this was in preparation for our talent show, we must perform in our costumes. \n\nThe skater goes first, he turns the floor into slippery glass doing his routine that we saw him perform. We were expecting the climax of the jump, suddenly the skates and the floor disappear as lord briar announces he wants a dance. The skater looks back at us for a partner so Johnny volunteered. Drunk out of his mind he twirled like pro as the skater does the quadruple pirouette without skates \n\nJohnny noticed Alt smiling in the crowd. He extends a hand towards Alt who jumped in and they all danced happily","is mind he twirled like pro as the skater does the quadruple pirouette without skates \n\nJohnny noticed Alt smiling in the crowd. He extends a hand towards Alt who jumped in and they all danced happily around each other, a rare occasion seeing that Alt was always hard almost cruel to Johnny. I volunteered to be Chimer's partner he agrees but offers to perform his national dance first as he danced the symbol on his body start to glow and using his druidcraft he made flowers sprout around him chanting like a war match. I walk up to him in the chest and we start to dance he took the lead but it was hard to move in the chest. He did his little haka dance and I came and gave him a supporting beat by knocking my box around then we jumped into an elegant ballroom dance to appease lord Briar. The Fairy all alone gave Hui big sad eyes. Who agrees to dance with her, he wears Bob like a costume which the Goblins liked and goes to dance with her they didn't do very well.\n\nLord Briar stands up and he claims that he wants to see a kungfu fight, fight your partner.\n\nChimer starts to swing his staff around and always falls short of me. I try to tickle him while making kungfu noises. Johnny does naruto hand gestures and slams into the ground and trips us all up. Chimer and I were the only ones to jump over his attack. The Goblins give Chimer and Johnny a pass. \n\nJohnny materialized his guitar and ripped a chord as the crowd danced around us and passed food and alcohol enjoying themselves. \n\nHu","jump over his attack. The Goblins give Chimer and Johnny a pass. \n\nJohnny materialized his guitar and ripped a chord as the crowd danced around us and passed food and alcohol enjoying themselves. \n\nHui stands up and gives a long wordy presentation about why he should speak with the Traveler to prevent the end of the universe, lord Briar demands he do an interpretive dance to express himself on the issue, he tried but he wasn't very good and lord briar dismissed him. Lord Briar gave his point to the one with the most heart, Chimer and the goblins gave their point to Johnny. We were faced with one last challenge: it was to figure out which one of us was the doppelganger. It was revealed that it was me. A satyr revealed himself as me as I walked out of the woods zipping up my pants. The Briar king announces that the competition was to keep tradition alive. The goblins tallied up all the complaining that was done by the challengers, we had to pay 10 gold for each complaint. The Fairy complained once. The Skater complained twice. John 4/Chimer has complained once. John 1/Johnny you complained twice. John 2/ Raigen complained once. John 3/ Hui complained 12 times! Hui gets up on his Mewfour and blasts us with a sick musical blast. Chimer pays for himself. I pay for Johnny and Hui and myself. Lord Briar thanks us for participating in the festivities, \n\nChimer asks him for a commemorative coin. Lord Briar reaches to a tree and grabs a leaf, transforming the leaf into a coin with the ","yself. Lord Briar thanks us for participating in the festivities, \n\nChimer asks him for a commemorative coin. Lord Briar reaches to a tree and grabs a leaf, transforming the leaf into a coin with the symbol of the Traveler on it, the symbol of Rubedo. Chimer has a flashback when looking at the coin. He saw himself submerged in a green liquid in a vat in a lab. The liquid bubbled and he saw through them the same symbol of Rubedo on the wall. Next to him there was another tank with a humanoid figure in it. \n\nLord Briar reaches up to a clock and spins its needle until it spun rapidly by itself opening a portal in the tree.\n\nThe skater gets to come with us because he had gathered as many points as the winners. \n\nSeekers of the traveler I beg your forgiveness for our silly ways announced lord Briar. We told him that it was an honor and Chimer and I thanked him and we exchanged niceties and moved on with the skater. We walk into the portal that was created and the music fades away. \n\nWe find ourselves indoors in a big white room with six desks in a circle, all tattered and destroyed except one of them that still has stuff on it. On that desk there was paperwork about the reebis project. It seemed to be an old Reebis compound. research facility. \n\n\n\nWe found a photograph, the old man on the left was the spitting image of Hui on the right, a woman smoking a cigarette was a younger Gloria Slugbottom and to our surprise a dapper gentleman on the left was a human version of the host! Be"," the left was the spitting image of Hui on the right, a woman smoking a cigarette was a younger Gloria Slugbottom and to our surprise a dapper gentleman on the left was a human version of the host! Before becoming a cyborg. There were nicknames on the back of the photograph, they were: The Host, the Brain, the General, the Traveler and the Mechanic. The young tabaxi girl was unaccounted for in the names, probably because she was clearly a child and the person scratched out has their nickname scratched out as well.\n\nWe notice a giant machine that comes out of the building into the scorching outside. I cleaned us all up as we walked\n\nChimer mentions that the marble flooring was familiar. As if he has been in a Rebis compound before. \n\nPast a door we could see him fiddling with a machine. In his green robes he seemed to be struggling to keep the machine powered. It seemed to be powered by the solar flairs that whipped off the sun and struck the planet.\n\nI walk in still dressed in the green robes I got from the scarecrow disguised as the elf/ Traveler's younger self, from the photograph with Hui next to me looking like a mechanical Newton. He mumbled about the hallucinations being back. He ignored us and we got close enough to see his face. He looked exhausted. Hui puts his hand on him to show him that we are real which startled him Hui explained who he was and that he was created by Newton in his image. Clearly perturbed the Traveler slumps his shoulders and starts apologizing t","im to show him that we are real which startled him Hui explained who he was and that he was created by Newton in his image. Clearly perturbed the Traveler slumps his shoulders and starts apologizing to Newton and Chimer and he started rambling about that she told him that he had to do it, and he had to comply because the feywild has to exist. He looks back and forth and says that the lady vira that forced him to do this, to fragment the souls for a profit. You have to help me, he shouted.. \n\nSuddenly we hear gunfire and scramble outside where we saw Lord Briar standing there he fell to his face with bullet wounds in the back of his head. I kneel and hold him as his last words were that of the fey surviving. \n\nThere standing behind him brandishing the murder weapon was Harry! Yelling at us about surviving and making it this far. I can't let the don find out about this he said before raising his gun to us.\n\nA person steps off the elevator, a large intimidating man dressed all in black with a black backpack. He spots that one of the ships was surrounded by many guards. They explained to him that they were given orders to search the ship but the other ships docked with it started firing at them. He orders them to take a lunch break and leaves his goons to guard the ship from any future \n\nHe continues up and walks into the Don's office that seemed to be overwhelmed with paperwork. Spoke to the Don and told him that Elias Cooper was in charge of the Lincoln Station now. And that th","re \n\nHe continues up and walks into the Don's office that seemed to be overwhelmed with paperwork. Spoke to the Don and told him that Elias Cooper was in charge of the Lincoln Station now. And that the people who flew in on the marlin shaped ship were the people who dismantled the Lincoln Station. The Don told him about us actually being down in the tunnels!\n\nBob attacked first he started throwing a barrage of daggers at Harry, two of them melted before coming in contact with Harry's flaming body but Bob notices and his last knife he coats with psionic energy and hits Harry straight. He flings one last dagger that also connects.\n\nJohnny reacted next he shot his guns four times. Shoving Harry back a few feet\n\nHarry shoots a bullet back sending it between us and explodes! \n\nHui threw his Miew two to shield the traveler which shielded him from half the damage.\n\nFrom behind the doorway Harry swings his weapon and cuts Alt in half. \n\nHui stepped up and using his bonus action to use branding smite on himself and pulls out a crossbow and shot Harry twice one of them wasn't normal but he coated the next one with radiant damage and hit true. Then sends his Mewtwo to shield the traveler.\n\nHarry takes out a gem with a spirit in it cracks it and puts the pieces in his mouth summoning a firefox.\n\nI stepped up and tried to subdue him but I failed. I gave an advantage to Bob and an inspiration to Chimer. \n\nThe skater jumps up and does a pirouette distracting Harry. The fox fire elemental at","ox.\n\nI stepped up and tried to subdue him but I failed. I gave an advantage to Bob and an inspiration to Chimer. \n\nThe skater jumps up and does a pirouette distracting Harry. The fox fire elemental attacked Chimer, scorching him.\n\nChimer retaliated and cast shileyley and then attacked Harry wildly. \n\nHarry attacked the skater but Johnny stopped him, he was apparently a fan of Johnny Mythrilhand. \n\nThe dark dressed man warned the Don that he stopped the search of our ship, so he told him that he was already on it. The Don called out to him: Wait Raith I need to tell you something.\n\nHe warns him about Hassan, he gave the guards a slip. Wraith pinched the bridge of his nose. \n\nWraith asked to get the full names of the team members.\n\nHe walks out calling will. He sent him our names and the name of our ship and asked to get info on us. \n\nHe walks into the luxury apartments that the lord ifriti rented out for his family, he makes his way to Hassan's apartment. Security staggered him but he was granted access. He berates the guards that had let Hassan escape as he asks them for a brief of what happened.\n\nBob approached Harry sidestepping the fire fox, he expertly attacked Harry four times.\n\nJohnny while running up on the fox starts shooting juggling the fox with his bullets.\n\nHe turned towards Harry and filled him with bullets as well. \n\nHarry chewed up another gem and summoned another firefox.\n\nHe then runs up to Johnny and the skater and attacks him with two scimitar attacks Johnn","towards Harry and filled him with bullets as well. \n\nHarry chewed up another gem and summoned another firefox.\n\nHe then runs up to Johnny and the skater and attacks him with two scimitar attacks Johnny blocks with his metal arm as if it was nothing. \n\nSo he turned towards the doorway where Hui was standing and shot at him. Hitting \n\nHui healed himself. Then threw a hammer at the firefox.\n\nI cast phantasmal force on Harry but he shook it off. I gave Johnny an inspiration and then threw something at Harry.\n\nThe Skater attacked Harry trying to swipe at him but Harry was a much better trained fighter, he side stepped him and grinned cruelly at the skater. The firefox attacked Johnny but because Harry was a fan of him they were halfheartedly attacking him so they missed.\n\nChimer attacked Harry next he throws \n\nThe fox whips at Hui. I distract him so he hits me, setting me on fire.\n\nHarry stepped up and attacked Johnny, slashing at him with his flaming sword hitting him in the midsection.\n\nWraith standing there watching the guards making excuses. Wraith asks if he took the phone with him and they tell him yes. He calls up Will again and gives him the phone to track and tells him that he forwarded him the bank information of Cornelius , to send us 2000 each and to do with the rest whatever he needed. \n\nWraith steps behind the bar and sees melted bars on the gate he sees something beautiful. A small patch of forgotten gems. He sees Hassan release a trapped spirit into one of the gems","ver he needed. \n\nWraith steps behind the bar and sees melted bars on the gate he sees something beautiful. A small patch of forgotten gems. He sees Hassan release a trapped spirit into one of the gems.\n\nHe lifts Hassan from his collar who first reacted agitatedly until he realized it was Wraith he spun and hugged him still lifted. He explained to Wraith what he was trying to do. So Wraith calls off the lord's forces and drags an anxious Hassan back to his dad.\n\nBob leapt forward, attacked and withdrew, swift and deadly as always. \n\nJohnny on his heels attacked as well, his eyes almost glowing as they exchanged blows. He then summoned Alt behind Harry. \n\nCrushing another gem Harry summoned a wall of fire to separate us from the traveler.\n\nChimer, mewfour and I fell unconscious. Hui healed me so I healed Chimer.\n\nThe skater does her distraction and attracts the fox and Harry's attention, she gets attacked by the fox and catches fire.\n\nChimer jumps out of the fire and raises his resistances \n\nThe firefox attacked Hui, setting him on fire.\n\nWraith carries Hassan giving him an earful as he drags him to his father. Mikey's firehair was frazzled and looked up as they arrived yelling at Hassan where were you he screamed and tried to send out Wraith who didn't budge. \n\nWraith makes Hassan explain to his father what he has been doing. Wraith shows Mikey the pictures. Mikey explained that even though his intentions were good by purchasing the crystals, Hassan was funding the problem. Mi"," explain to his father what he has been doing. Wraith shows Mikey the pictures. Mikey explained that even though his intentions were good by purchasing the crystals, Hassan was funding the problem. Mikey expressed that he too thought the spirits were a problem.and that Hassan's father probably agreed even if he would never say it out loud.\n\nWraith bends down to Hassan eye level and tells him that to make real change you should get a degree and make real changes. Mikey agrees. Wraith leaves them together and heads out to the crater. \n\nBob attacks three times, evaporating one of the foxes, he turns his attention to the other firefox slashing at it ferociously killing it as well. He then rushed Harry and attacked him.\n\nHarry stepped up and swiped at Bob, who morphed to avoid the sword but was hurt by the heat coming off of it.\n\nJohnny slaps himself on the forehead pulls out his cooling stone and puts it back on. He then goes to attack Harry firing his gun at him pushing him backwards. Shouting the whole time for Harry to \n\nHarry attacked him back but I managed to throw a rock at Harry making him miss Johnny with one of his two attacks.\n\nHui activated his own crystal stepped up to Chimer pulls his stone out of his pocket and stuck it to his back. \n\nI pull out my own stone activate it and heal Chimer who was looking bad. \n\nHarry stepped up and swiped at Johnny again hitting him this time. \n\nThe skater jumped in and inspired by us hit Harry twice doing significant damage.\n\nChimer r"," and heal Chimer who was looking bad. \n\nHarry stepped up and swiped at Johnny again hitting him this time. \n\nThe skater jumped in and inspired by us hit Harry twice doing significant damage.\n\nChimer ran, still on fire, to attack Harry. He swung furiously.  A black flash slams into Harry who goes down as he is trying to bite down on another crystal. \n\nJohnny heals the traveler who was furiously screaming about the machine becoming unstable he starts to mess with it. He transfers all the energy from the fabricator to the machine and pulls out a little piece telling us that this was rubedo, it looked slightly damaged as if pieces were missing and he has been replacing the damaged pieces with his big machines. \n\nThe traveler was using the solar flairs to power this thing. \n\nHui pulls out pieces from the damaged Mewfour and puts the fabricator back together. So the traveler with surprise asked him how he did that. I asked what would happen to the feywild. Johnny grabs Mewfour Hui and I and runs out yelling at the skater to do the same. We jumped through the portal that the lord briar had left behind. Devilish imps ran around hurting the people of the feywild, casting fireballs and carrying out some sheep and fighting the fighters. \n\nWraith arrived at the limit of the forest that looked to be rushing towards him without actually approaching. Wraith runs in rushing past the speeding forest until he encountered an imp trying to carry off someone who was clutching on a tree branch for","d to be rushing towards him without actually approaching. Wraith runs in rushing past the speeding forest until he encountered an imp trying to carry off someone who was clutching on a tree branch for dear life, in the distance there were many more imps. Wraith watched in surprise as he realized that the creature being harassed was a stringent a creature of the feywild! What was going on here! Wraith saved the creature The imp attacked Wraith who blocked him by pulling out his sword. He slashes at the imp who hurts hard and turns to run away holding its wound. He pushed further in.\n\nWe stood surrounded by everyone rushing away from the approaching fire wall as the imps tried to kidnap people we shot and fired at the imps as we rushed through.  We get stopped by a group of imps holding a big boulder.\n\nThe owlbear and the miner jump up and take out the imps\n\nWe rush together untill we reached Wrai\n\nMedium tk tall with tattoos on his forearms and a long sword and guns with dark black hair and purplish blue eyes we grabbed him by the elbow and dragged him with us. He bellows for all the fey creatures to run. As we ran in a huge group of strange creatures and critters. Wraith tried to call someone. But there was no reception down here. \n\nWraith opens up a pair of wings to evade, everyone else jumps out of the way except for me and Hui who trip and fall.\n\nHui gets nudged up by the owlbear and gets carried out. Johnny goes back for me; he picks me up as the wall of fire approaches u","one else jumps out of the way except for me and Hui who trip and fall.\n\nHui gets nudged up by the owlbear and gets carried out. Johnny goes back for me; he picks me up as the wall of fire approaches us. Wraith jumped in and helped Johnny right in time to grab me and they ran. \n\nBob, disguised as a cat, ran alongside us. Miaw.\n\nWe reach the end of the tunnel, Hui gets tossed off the owlbear as we exited the tunnel we passed the exit and turned back and saw the fey creatures stayed behind I screamed for them to hurry but they never crossed the threshold, the owlbear nuzzled the miner and pushed him away, families hugged, lovers kissed as we watched horrified until the last blade of grass was burnt. Then the imps emerged carrying crystals. We shot down as many as we could but many of them escaped. \n\nHui had multiple messages from the businessman we had picked up yelling about the situation of the Marlin and the other two ships. \n\nChimer got a call from his mom telling him that he has to come back quickly, his dad was very sick, he had some sort of cardiac arrest. She insisted that he should come back, he told her that he would be back as soon as possible. \n\nJohnny looked around at all of us battered and bruised. \n\nThey aren't dead, they returned to the etherium. The traveler tells us that he has been pulling them out of the etherium.\n\nWraith introduced himself. And told us to go back to the Don.\n\nHui told the Traveler to take it easy as we cut to all of us in a spa resting, even","s that he has been pulling them out of the etherium.\n\nWraith introduced himself. And told us to go back to the Don.\n\nHui told the Traveler to take it easy as we cut to all of us in a spa resting, even mewfour's head was floating relaxing as well. We all got a message from our bank account that 2000 gold was added to each of our accounts. We reacted surprised as Wraith told us it was for our efforts on the Lincoln station. \n\nHealing in the beautiful baths Hui told us that the businessman was still on the ship and that he was blowing up his phone. We brush the information off. We sat in the foreigner section of the baths seeing that we couldn't support the extreme heats that the locals could. \n\nWraith reports to the Don. He tried to question us but we asked who he was. He was the second in command of the Don he was a hit man for hire. Bob tried to look him up and didn't find him in any assassin database. Bob tried to preach the washing machine god. But Wraith's eyes shone with understanding. He had heard of the washing machine god when he passed by Lincoln station. He tried to get information out of us but we weren't sure we could trust him. He even tried to intimidate us with some goons but I disarmed them when I asked if he was threatening us with a good time. Bob used the pipes to go check on the ship as I tried to talk Wraith into taking a bath with us but he decided to go make sure our ship wasn't impounded. He asked about the Traveler and wanted to take him to the Don but","to go check on the ship as I tried to talk Wraith into taking a bath with us but he decided to go make sure our ship wasn't impounded. He asked about the Traveler and wanted to take him to the Don but I told him that he has been with us the whole time.\n\nBob reaches the port and he zips past the guards into our ship. Skillfully he gets into the ship and scares the shit out of Thillian Romain. Who was talking to a broom with a face drawn on it. He has been stuck there the whole day so the place was a mess. Bob psychically reached out to Johnny who first asked about his guitar once Bob assured him that it was in his room untouched so he had no further questions. Bob insisted that it was important but Johnny complained about wanting to enjoy his Martin. Bob insisted so we made a plan to go drop off the Traveler on Rodina while heading to Niniche to check on Chimer's father. Hui slips away to a little corner in the lobby where it was crowded enough that he could make a phone call without being overheard. He is called Gloria Slugbottom. A gruff voice answers it was Gloria, Hui tells her that we went to the place and we picked up a thing. She tells him to answer another phone call and calls him back from a secure line. He tells her that we got the Traveler. She tells him to bring Neal there. Hui closes the phone and looks up to a bulletin board and sees all of our faces on an old fashioned wanted list. The crime was kidnapping. It claimed that we had kidnapped the Traveler. Hui trie","here. Hui closes the phone and looks up to a bulletin board and sees all of our faces on an old fashioned wanted list. The crime was kidnapping. It claimed that we had kidnapped the Traveler. Hui tried to sneak back but was spotted by an erenis a deep purple skinned devil in a suit armor thing, as he was ordering a coffee. Hui rushed off pretending to get his coffee order. He got back to us and warned us about the situation. I pretended to be Mikey and I had the goons clear the bath house. We made our way out in the commotion. And hid in a dark alley. I received a location from Wraith showing me the location of a pub where he wants us to meet. Wraith was chilling there waiting for us. I sent him the picture of the wanted posters and a poop emoji as a reply. He almost spat out his drink. He furiously looked up the situation. The bounty was set by the tower of ash (the white house for the rulers). He sent us to stay put and that he is joining us to lead us through a secure route to the ship. I replied with a picture of my butt. Wraith swore out loud and made his way to us. As he was approaching us he received news that the royal guard was after us so he knew who to avoid. He set up a diversion. He guided us through the backstreets. We clunked as stealthily as we could through the pathways. He walked us through the people's houses who were so incredibly hospitable that we were gifted sweets and fruits as we intruded on their homes!. Running out of the housing district and findin","athways. He walked us through the people's houses who were so incredibly hospitable that we were gifted sweets and fruits as we intruded on their homes!. Running out of the housing district and finding ourselves face to face with a police barricade. Johnny disguised himself and so did I. Tabaga cast a major illusion and turned us into backup dancers for her. We walk through the crowd not being recognized. We got confronted by someone who was yelling about foreigners taking their jobs. The guards let us through just to end the screaming. On the docks people from the Wilds and Apatia came here for work so we looked exactly like them! Did Tabaga know or was this just a lucky coincidence?  The Don's people stood around waiting to be a distraction when Wraith gave the signal. \n\nThe two ships stood like guard dogs around the Marlin, it was attracting attention being so out of the ordinary. We caused a distraction claiming that the wanted people were “over there”. Hui and Johnny walked through the glass barrier not noticing it and they shattered it, causing a loud crash that brought everyone's attention back. Bob started the engine. Wraith gave the command to the Don's men to create the distraction as he took off running and we all jumped into the ship in our own way. Wraith runs in looking like he was going to stab us all pretending to chase us. Thillian Romain almost shat himself. We all piled into our ship and prepared to take off. Wraith installs the Don's programs to help Us na","king like he was going to stab us all pretending to chase us. Thillian Romain almost shat himself. We all piled into our ship and prepared to take off. Wraith installs the Don's programs to help Us navigate, Chimer expertly moves the ship maneuvering us out of there, the two ships on our trail. Once we were out of range I stepped outside and thanked the two ships for protecting the Marlin.\n\nWe sit with the Traveler and show him the picture he tells us\n\nFrom left to right: \n\n1- The Host - Bosh Kyros.\n\n2- The Traveler- Neal Ferguson. \n\n3- The Brain - Hui Newton. \n\n4- The General - Xenathel Salamine. March royalty a powerful military family \n\n5- The Mechanic - Gloria Slugbottom.\n\n6- The producer - Dextra Norton. \n\nREBIS what were you guys researching?\n\nThe Host founded Rebis to save the universe so he put together a team of capable people. Certain companies started benefiting from the situation,  companies started rising feeding on the despair .\n\nUltimum inc needed an artificial intelligence something to run the machine that you can plug yourself into and \n\nThey started picking at the Rebis team trying to bring them over to help with their machine. They kept refusing them except for Dextra which is why she is scribbled out. They even tried to destroy Rebis so that they would have no reason to say no anymore,  then the raid happened and Ultimum inc was declared a criminal organization. Hui and the Traveler showed each other their research comparing and discussing. Hui asked about"," reason to say no anymore,  then the raid happened and Ultimum inc was declared a criminal organization. Hui and the Traveler showed each other their research comparing and discussing. Hui asked about the young girl in the pictures. \n\nEmily was adopted after her parent's death. by Bosh who basically lived at the lab. Then they vanished. There was news of him genetically modifying animals and bringing them back from extinction and rereleasing them to the wild. We had seen the host on the station.\n\nWraith called Will who forwards him some information. And he sent him the names we had just received so that he can get info on them. He reads the info that was sent by Will and sees that Ultimum inc had put out a hit on Gloria. The hit came from Apatia, the planet Will was on right now. An organization had refused but they were so secret that no name was listed. The big organizations hadn't accepted it though only small low life mercenaries. This hit has been active for a few years now. Wraith asks then why did I receive the hit recently. He finally shows us the hit on Gloria.  \n\nBob looks into it from his end and finds out that Eve Stabber was working for them under a different contract. Johnny asked Wraith if he knew anything about his history with Ultimum inc. Wraith looked in disbelief while Johnny explained that he didn't know how or why he did it but he did leak the information that Ultimum inc was trying to destroy the Rebis labs. Wraith notices a strange mismatch with the ti","ief while Johnny explained that he didn't know how or why he did it but he did leak the information that Ultimum inc was trying to destroy the Rebis labs. Wraith notices a strange mismatch with the timeline. Johnny was 90 years old or more but he looked so young. He destroyed Ultimum inc 30 years ago. On August 2nd. He stormed in with a bunch of mercenaries and stole the information and made it public. It happened on Apatia. Johnny even summons Alt to confuse Wraith even more. She boops Wraith on the nose. He looked her up and down in disbelief. We turn and notice that a solar flare erupts from the sun and hits Sulfur creating the Aurora borealis. It was beautiful. The Traveler cried out if the solar flair had happened yesterday this wouldn't have happened. I put my hand on his shoulder and told him that we will rebuild, he was an elf and the feywild was in their culture. He said he started when he was 16, now he is 40.\n\nXenathel was hit the hardest. When Dextra sent them the eviction notice. He was very hurt but stood his ground allowing the rest to escape. Him and the Host fought to protect them, Bosh escaped but we all thought Xenathel was dead but he appeared traveling around the March seeming different. Walking around for years not looking at anyone or talking to anyone. Last he heard he was locked up on Rhodina. He heard Newton passed away, when he saw Hui he was hoping that he had done a personality transfer but that wasn't the case. He asked us why we were trying beca","t he heard he was locked up on Rhodina. He heard Newton passed away, when he saw Hui he was hoping that he had done a personality transfer but that wasn't the case. He asked us why we were trying because of Fantoma, the planet that disappeared. They discussed the pieces that we were searching for. Chimer asked the Traveler why he apologized to him when he first saw him. The Traveler tells him that he thought he was someone he knew. Chimer bursts out about who it was because he's been looking for someone like him, and he begins to ramble about how come a machine told him he was hundreds of years old while he was only 27.. the Traveler looked like he knew something but chose to stay quiet so Wraith pressed him. On the March they get a vision leaked into their brain of an ancient civilization. There was an artist's recreation of the ancient civilization that built the march and led to all the scientific discoveries that also brought forth the creation of the machine. They looked exactly like Chimer. Chimer seemed not okay.. he starts to waver and then passes out. He sees himself in that familiar green liquid, never was it this clear before. He was in a Rebis lab, the second tank next to him had the same dark form in it. He hears a little tap on the glass, he spins around to see a small elvish boy, it was Neal taking notes on a clipboard. We frantically resuscitated him. He jolts up enraged, swearing at the Traveler.\n\nAs we approached Rodina the two ships seemed nervous. The clos","all elvish boy, it was Neal taking notes on a clipboard. We frantically resuscitated him. He jolts up enraged, swearing at the Traveler.\n\nAs we approached Rodina the two ships seemed nervous. The closer we got we received a phone call. It was the authorities, there were two escaped convicts apparently that they were looking for, we informed them that we were here to see Gloria. They step away from the line for a moment we hear yelling and they let us pass. We park our ships in the free parking of the port and step out to technicians running around keeping the machines on the docks maintained. As usual Rodina was full of people, the only people not in the crowd were politicians. People of that high stature were forbidden in Rodina for security reasons. We made our way to the monorail, right before we reached the banana guard station it broke down. We hung there with the rest of the people wondering what was happening. Suddenly the power turns off and we all scramble for torches, Chimer summons a big green light, giving the room a sickly glow. Blood splattered on the outside of the train cart. People were panicking so Hui asked me to calm them down. I encouraged them all to work together and managed to calm everyone down. We ask them what the people out front can see, it returns to us through the crowd saying it's an angel. Okay obviously that's not what they saw! Below us we see the corpse of a banana knight! Johnny summoned Alt on top of the cabin and switched with her; she l"," us through the crowd saying it's an angel. Okay obviously that's not what they saw! Below us we see the corpse of a banana knight! Johnny summoned Alt on top of the cabin and switched with her; she looked perturbed when she appeared in his place. Johnny looked around into the night which would be pitch black if not for a giant Pailor wielding a sword of flame bringing it up to a defensive stance when something hit him knocking them both out of our field of view. \n\nHui pulls out his frill phone and a piece of Mewfour and hacked into the train he calls emergency support. Within seconds machines arrive and attach emergency slides to the cart and we start to help people down. On top of the cart Johnny instinctively ducked, barely avoiding a dagger thrown by a female tabaxi in a prison uniform. It was the same ninja we had captured last time we were here! He swung around and instinctively pulled out his gun and shot her twice. Hui tells Johnny to come down and that he will lurch the train forward, knocking her off. Johnny tells him he can take it so Hui does it, Johnny keeps it together she gets flung but saves herself using a dagger and a rope. She punches a hole into the second cart and drops a machine of sorts into the cart. Salutes Johnny and jumps off the ship. Johnny yells back at us to keep away from whatever she dropped. Hui hits the brakes suddenly, it appeared that the cart we were in had a gravity field to keep us from being knocked around but the other cart had it tur"," at us to keep away from whatever she dropped. Hui hits the brakes suddenly, it appeared that the cart we were in had a gravity field to keep us from being knocked around but the other cart had it turned off because it was empty so the machine flew through the window crashing into our cart and Chimer caught it. Hui quickly grabbed it and disarmed it by cutting wire. Hui deduces that our current track will take us straight into the fight. We regrouped and decided that we needed to prioritize delivering the Traveler and maybe helping Pailor who was clearly struggling. Hui rigs the bomb to explode when it connects. We give it to Mewfour who stands in pitching position on top of the cart ready to throw it. And Hui puts the train into full gear. We barrel forward. I stood in the front singing in latin like a mad man inspiring the rest. Johnny fortified himself and aimed at the giant form but the thing didn't even feel his attack. Johnny yelled at Chimer to try and shoot it as well. But Chimer's attacks also had no effect. I sent Pailor a message to: lead it this way! We have a bomb. Hui signals to Mewfour who immediately chucks this bomb the cart recoils from the power of the throw. Pailor, having heard my message, kicks this thing in the chest and holds him from the neck in place as the bomb connects with his abdomen and explodes, dropping him to the ground. \n\nIt looked like a fallen angel, the corrupted ones, when the face of the creature appeared in the light the Traveler recog","the bomb connects with his abdomen and explodes, dropping him to the ground. \n\nIt looked like a fallen angel, the corrupted ones, when the face of the creature appeared in the light the Traveler recognized him as Xenathel, so he called out his name. Hearing the Traveler the creature's eyes turn to us and pain flashes in its eyes as it turns to run. Hui tried to shoot at it but it was out of range.\n\nHui heals Pailor who thanks him and takes off to follow the creature with Johnny who slaps him on the behind as he flies off, inspiring him. \n\nWe turn to the Traveler demanding answers: why was his old teammate a giant corrupted angel? He said they thought he was dead but something weird happened on the March. They knew that all the demon lords had died but there was news of one who apparently was walking around by himself; the last one left no platoon or army just by himself. They called him death, they called him many names but no one was able to stop him. But the Traveler and Gloria knew better. They went to get him and put him in captivity, keeping him as safe as they could. \n\nThe story goes that Xenathel had stayed behind to allow the rest to escape and they had thought him dead until stories came up about that creature in the March. \n\nJohnny described the tabaxi that had attacked him and having met her before and the cult that she was a part of. \n\nThe cult of the Sun.\n\nGloria told us that it seemed that the girl played us for fools. She got caught on purpose to be sent to thi"," him and having met her before and the cult that she was a part of. \n\nThe cult of the Sun.\n\nGloria told us that it seemed that the girl played us for fools. She got caught on purpose to be sent to this maximum security facility so as to free Xenathel. \n\nJohnny tells us that he is from another time and that this wasn't his original body. They had killed the previous me and saved a piece of him as an AI then this man Hank saved him and that was who's body he was in right now. Johnny summoned Alt. The Traveler was fascinated but we all confronted him about the inhumanity of it all and the Aphrodite situation. He was more interested in the science and the scientific possibilities instead of the humanity of the situation. Chimer confronted him about doing something to him in the vat. The Traveler told us that the green fuel was actually embryonic fluid and that Chimer was made from that. He tells us that they used the military funding of the March wars that have been ravaging that planet to test and fund their inventions. That they allowed the fighting to go on and enticed it for their science. We all didn't like that. \n\nWe arrived at the big machine and were met with medics and Edna. We didn't need medical attention so Edna led us straight to Gloria. We found her hooked up to an IV bag watching a bunch of monitors that were security footage of the events. She greets Neal warmly, she struggles to get out of her chair to hug him. He steps back still smiling but a sadness could be s","ag watching a bunch of monitors that were security footage of the events. She greets Neal warmly, she struggles to get out of her chair to hug him. He steps back still smiling but a sadness could be seen in his eyes at seeing his old friend in such a frail state.\n\nHui confronted Gloria about not telling us that she knew the tabaxi ninja that had attacked us. She looked at Neal and asked him in a foreign language how much he had told us, in common he answered everything. Gloria told us that she spoke to Emily to find out why she had joined that cult but she didn't seem to recognize her. Was she brainwashed or acting?\n\nWe asked Gloria what she knew about the cult of the sun so she hacked into Pailor ‘s research files and brought up everything about them, they had been harassing him for a while now so he put together a comprehensive file on them.0 \n\nThere was a report of a peaceful protest on the wilds going sour and the police force shut it down, turning them into an armed militia which was in turn squashed by a Mark. They became nihilists and grew to reach Apatia, the wilds and Niniche's back side, the vacation side. \n\nNeal gives Gloria the fabricator who was surprised that we managed to find it. I told her that I didn’t appreciate her surprised tone! And that we were very capable. \n\nWe press her on letting us use the locator. Hui insists on trying it .Her and Edna lead us through a lab, where everyone was scrambling to secure the equipment, towards a panel behind lock and key",". \n\nWe press her on letting us use the locator. Hui insists on trying it .Her and Edna lead us through a lab, where everyone was scrambling to secure the equipment, towards a panel behind lock and key. Hui makes it locate the headquarters of Ultimum inc which turn out to be in Apatia. We ask where there is an accessible place that can take us to Phantoma. This time the machine jolted violently and the power in the lab faltered then an image appeared. Gloria was surprised to see that an image appeared she hadn't programmed that feature in. An image of a planet surface where there was greenery pointing at a planet with a moon next to it with two asteroids between them. Chimer and Hui's eyes shone with recognition.  A festival thrown on the wilds before and after the planet goes through the asteroid belt. And that there have been unconfirmed reports of sometimes being able to see Phantoma through the asteroid belt during that event!\n\n\n\n\n\n\n\n\n\n\n\n"],"total":143}